[
    {
        "id":0,
        "que":"Co z otrzymanym datagramem IP adresowanym do hosta 2.2.1.1 zrobi nie-klasowy ruter IP posiadający w tablicy rutowania IP reguły 2.2.0.0\/16 via 1.1.1.1 i 0.0.0.0\/0 via 1.1.1.2",
        "ans":"Zrutuje do 1.1.1.1"
    },
    {
        "id":1,
        "que":"Do czego służą tzw tokeny w tablicach rutowania stosowanych w tablicach MPLS?",
        "ans":"dokąd przełączyć datagram, jakie operacje na stosie MPLS datagramu wykonać"
    },
    {
        "id":2,
        "que":"Kiedy ze stacji roboczej pracujacej wysylany jest datagram Gratitious ARP",
        "ans":"gdy ustawimy adres IP na pracujacym serwerze sieciowym lub gdy włączymy wyłączone urządzenie"
    },
    {
        "id":3,
        "que":"Czym różni się limitowanie przepustowości w technice Leaky bucket od zwykłego ograniczenia przepustowości (zadanego np. w bps)?\t",
        "ans":"leacky bucket jak w \"wiadrze\" skąd wysyłane, w bps po prostu ograniczamy prędkość \/\/leaky bucket jest jak zbiornik z odpływem, a ograniczenie jest jak zwykła rura o zadanej przepustowości"
    },
    {
        "id":4,
        "que":"Dlaczego stosuje sie tzw. strategie TCP przy nadawaniu strumienia danych w tym protokolell",
        "ans":"aby uniknąć przeciążeń łacza"
    },
    {
        "id":5,
        "que":"Jaką wysokość (w calach lub centrymetrach) posiada przełącznik RACK o wymiarze 4U",
        "ans":"7\" lub 17,78 cm"
    },
    {
        "id":6,
        "que":"Jak w nomenklaturze OSPF nazywamy ruter IP, który dokonuje redystrybucji wiedzy o sieciach z BGP do OSPF",
        "ans":"ASBR "
    },
    {
        "id":7,
        "que":"Jak nazywamy urządzenie operatora, do którego biegną kable DSL od ruterów DSL poszczególnych abonentów (w nim następuje konwersja do innego medium)",
        "ans":"DSLAM (DSL Access Multiplexer)"
    },
    {
        "id":8,
        "que":"Angielskie określenie czasu prześcia danego datagramu do celu i spowrotem ",
        "ans":"Round-trip-time"
    },
    {
        "id":9,
        "que":"Angielska nazwa reguły postulującej wybór z ip forwarding table najbardziej precyzyjnej reguły rutowania IP",
        "ans":"longest prefix match"
    },
    {
        "id":10,
        "que":"Podaj przykład protokołu wobec którego stosowana jest technika RED load shedding",
        "ans":"TCP"
    },
    {
        "id":11,
        "que":"Zbudowałeś system sterowania na bluetooth w kórym bluetooth master to Twój telefon. Ile ma maksymalnie bluetooth slave możesz jednocześnie sterować?",
        "ans":7
    },
    {
        "id":12,
        "que":"Jak nazywamy chwilowy duży przepływ danych wsieci komputerowej",
        "ans":"burst"
    },
    {
        "id":13,
        "que":"Podaj liczbę grup IPv4 multicast możliwych do rozróżnienia w przełączniku Ethernet po zakodowaniu numeru grupy w adresacji Ethernet MAC",
        "ans":"2^23"
    },
    {
        "id":14,
        "que":"Jaką topologie fizyczną sieci komputerowej wytworzy ukłąd połączeń urządzeń aktywnych określamy mianem \"daisy-chain\"",
        "ans":"liniowa lub pierścień"
    },
    {
        "id":15,
        "que":"Wszystkim interfejsom urządzeń, także stacjom PC, na rysunku nadaj adresację IP wersja 4 w klasie A zgodnie z ogólnie znanymi regułami. Dodaj do konfiguracji adresy domyślnych bramek w stacjach PC, aby wymusić domyślnie komunikację poprzez bezpośrednio podłączone rutery.",
        "ans":"(zdjęcie obok)"
    },
    {
        "id":16,
        "que":"Zakładając adresację IP topologii sieci z poprzedniego zadania podaj reguły rutowania statycznego dla obydwu ruterów takie aby umożliwić komunikację pomiędzy dwoma stacjami PC także w przypadku awarii jednego dowolnego z łącz pomiędzy routerami",
        "ans":"R1 (po lewej):  \nip route 5.0.0.0 255.0.0.0 2.0.0.2\nip route 0.0.0.0 0.0.0.0 3.0.0.2\nR2 (środkowy):  \nip route 1.0.0.0 255.0.0.0 3.0.0.1\nip route 5.0.0.0 0.0.0.0 4.0.0.2\nip route 0.0.0.0 0.0.0.0 4.0.0.2\nip route 0.0.0.0 0.0.0.0 3.0.0.1\nR3 (po prawej):  \nip route 1.0.0.0 255.0.0.0 2.0.0.1\nip route 0.0.0.0 0.0.0.0 4.0.0.1\n"
    },
    {
        "id":17,
        "que":"Do Twojej firmy doprowadzono światłowód Ethernet duplex 1000Base-SX bez zakończenia wtykiem. Naszkicuj, połącz na rysunku i podpisz komponenty, które trzeba zaangażować aby doprowadzić światłowód do przełącznika Ethernet z gniazdem SFP (Small Factor Plugable)",
        "ans":"Trzeba zaspawac pigtail z wtykiem np LC -> wkładka sfp z portem na LC -> gniazdo SFP"
    },
    {
        "id":18,
        "que":"Za pomocą odpowiedniego rysunku i jego opisu zawierającego dane adresacyjne przedstaw zasadę działania rutowania pomiędzy sieciami VLAN w Ethernet, implementowanego z wykorzystaniem przełącznika Ethernet wartwy 2 (Layer 2 switch) oraz niezależnego rutera IP",
        "ans":"switch połączyć z routerem trunkiem, w routerze robimy podinterfejsy int fa0\/0.xx (jakiś numerek) i w tym piszemy encapsulation dot1q <vlan_id>, ip address jako gateway dla danego vlan, no shutdown na głównym interfejsie, routowanie jak wyzej"
    },
    {
        "id":19,
        "que":"Dlaczego  w technologii 10GB ethernet nie jest już implementowana funkcjonalność CSMA\/CD",
        "ans":"CSMA\/CD nie posiada mechanizmu unikania kolizji w przeciwieństwie do CSMA\/CA; Full duplex"
    },
    {
        "id":20,
        "que":"Na jakie składowe podzielone jest pasmo częstotliwości Cable modem",
        "ans":"Upstream\/ TV + Audio\/ Downstream (Upstream\/ TV + FM\/ Downstream)"
    },
    {
        "id":21,
        "que":"Na podstawie jakich konfigurowalnych parametrów obliczana jest długośc chwili czasowej TC dla token bucket w technologii Traffic Shaping",
        "ans":"CIR, BC:"
    },
    {
        "id":22,
        "que":"Z jakiego powodu identyfikator BID każdego urządzenia pracującego w ramach protokołu PVSTP musi w sobie zawierać VLAN ID",
        "ans":"bo jest bridge dla każdego vlanu osobno. PVST = per vlan stp"
    },
    {
        "id":23,
        "que":"W jakim celu przełącznik Ethernet emituje do sieci ramki \"loopback\"?",
        "ans":"Diagnostyka (?)"
    },
    {
        "id":24,
        "que":"Dlaczego proces BGP w ruterze IP należy uruchomić na bazie interfejsu loopback",
        "ans":"żeby sesja sie nie zerwała (?)"
    },
    {
        "id":25,
        "que":"Po czym zorientujesz się, że na hoście docelowym nie ma aplikacji, która mogłaby odebrać datagram UDP, który wysłałeś? (nie masz dostepu do hosta docelowego)",
        "ans":"Port unreachable? "
    },
    {
        "id":26,
        "que":"Co mówą ci słowa: Tahoe, Slow Start, Reno w kontekscie sieci komputerowych?",
        "ans":"Strategie TCP"
    },
    {
        "id":27,
        "que":"W jaki sposó w datagramie IPv6 można zawrzeć informacje o fragmentacji, skoro w jego nagłówku nie ma pola identyfikującego przesunięcie lub numer fragmentu",
        "ans":"extension headers (opcja fragmentation)"
    },
    {
        "id":28,
        "que":"Przy użyciu jakich komunikatór będziesz wymieniać informacje pomiędzy urządzeniami ZigBee End Device i ZigBee Coordinator w swoim systemie",
        "ans":"AT"
    },
    {
        "id":29,
        "que":"Jak sprawdzisz (bez urządzeń), czy światłowód o znanej Ci długości będzie się nadawał do uruchomienia technologii 10GBase-SR",
        "ans":"spektrometrem (bez urządzeń??) przleczytać opis na kablu "
    },
    {
        "id":30,
        "que":"Dlaczego dwa routery w systemie eBGP muszą być połączone bez pośrednictwa innych routerów IP",
        "ans":"TTL = 1\n"
    },
    {
        "id":31,
        "que":"Dlaczego przygotowując szyfrowany przekaz przez sieć trzeba przestrzegać zasady redundancji? (należy przedstawić tylko technikę ataku)",
        "ans":"Atak: ktoś wysłał jakis losowy komunikat bez redundancji i np.: rolety w banku się puszczają, bo akurat trafił "
    },
    {
        "id":32,
        "que":"Czym różni się firewall stanowy [statefull] od bezstanowego? ",
        "ans":"bezstanowy nie zapisuje stanu połączeń, które przez niego przechodzą"
    },
    {
        "id":33,
        "que":"Podaj przykładowy adres IPv6 6to4 będący odpowiednikiem adresu Ipv4 5.5.5.5",
        "ans":"2002:0505:0505::\/48\n2002:0505:0505::\/16"
    },
    {
        "id":34,
        "que":"Podaj  przykładowy URL dla protokołu HTTP wykorzystujący adres IPv6 5:5::5:5 i port 443",
        "ans":"https:\/\/[5:5::5:5]:443"
    },
    {
        "id":35,
        "que":"Z pomocą poniższego rysunku wyjaśnij zasadę funkcjonowania łącza (...) we wszystkich możliwych konfiguracjach (także w stacji PC). Podaj koniecznie adresację (...) routerów w tej konstrukcji",
        "ans":"(zdjęcie obok)"
    },
    {
        "id":36,
        "que":"Wyjaśnij na podstawie własnoręcznie stworzonego rysunku zasadę funkcjonowania technologii private VLANs w Ethernet",
        "ans":"mamy w konsekwencji 3 sieci (wyobraźnią rysu rysu)\n1. Primary VLAN ktory przekazuje ruch  publiczny do innych Private VLANS\n2.Isolated VLAN , czyli port moze sie komunikowac tylko z Primary \n3. Community VLAN , gdzie komunikacja jest w ramach Community Primary VLAN \n\n(zdjęcie obok)"
    },
    {
        "id":37,
        "que":"Na poniższym rysunku zdefiniuj adresy IP oraz adresy domyślnej bramki dla wszystkich trzech stacji PC - tak aby możliwa była komunikacja do internetu. Zakładamy iż stację PC nie posiadają żadnej dodatkowej konfiguracji rutowania IP, a wiedza o rutowaniu IP w ruterach jest prawidłowa.",
        "ans":"(zdjęcie obok)"
    },
    {
        "id":38,
        "que":"Posiadasz dwa telefony IP oraz dwa telefony POTS, za pomocą odpowiedniego rysunku i jego opisu przedstaw instalację która pozowli na prowadzenie rozmów pomiędzy dowolnymi z tych telefonów. Opisz zaangażowane w instalację urządzenia oraz wykorzystywane w nich gniazda.",
        "ans":"(zdjęcie obok)"
    },
    {
        "id":39,
        "que":"Co zrobisz aby do obszaru (area) OSPF Twojej firmy nie dostawały się informacje o sieciach znajdujących się w iinnych oszarach area OSPF, ale można było za pośrednictwem OSPF otrzymać dowolną wiedzę o sieciach w internecie?",
        "ans":"Not so stubby area"
    },
    {
        "id":40,
        "que":"Ile sesji iBGP należy utworzyć gdy  w iBGP uczestniczą 4 rutery IP a topologia fizyczna połączeń to ruter: ruter: ruter: ruter",
        "ans":"6?"
    },
    {
        "id":41,
        "que":"Dlaczego w technice Assured forwarding QiS stosuje się akurat cztery kody typu Class of Service (CS1-CS4)",
        "ans":"zeby byly cztery kolejki po 3 klasy"
    },
    {
        "id":42,
        "que":"Jakim określeniem nazywamy fragmentację datagramów w sieci komputerowej, po której defragmentacja występuje u odbiorcy a nie na drodze do niego?",
        "ans":"non transparent"
    },
    {
        "id":43,
        "que":"Jak rozpoznasz miejsce uszkodzenia światłowodu nie posiadającego opancerzenia do którego podłączony jest tester?",
        "ans":"Nie będzie na końcu światełka\/ światło będzie się \"wydostawać\" w miejscu pęknięcia"
    },
    {
        "id":44,
        "que":"Co jest celem procesu 'router solitication' stosowanej w ipv6 i współpracującym z nim protokołu NDP?",
        "ans":"Znalezienie routerów podpiętych na danym łączu w neighbour discovery protocol"
    },
    {
        "id":45,
        "que":"Nazwy parametrów protokołu STP w przełącznikach Ethernet wpływających kolejno na wybór aktywnej ścieżki do root bridge?",
        "ans":"cost ,priority, port number "
    },
    {
        "id":46,
        "que":"Dlaczego w technologii Ethernet wspierającej funkcjonalność CSMA\/CD musi istnieć limit długości kabla?",
        "ans":"W celu uniknięcia late collisions"
    },
    {
        "id":47,
        "que":"Adresy IPv4 wszystkich hostów znajdujących się w sieci 100.100.100.0\/30",
        "ans":"100.100.100.1, 100.100.100.2;"
    },
    {
        "id":48,
        "que":"Podaj zasadę działania ramkowania CRC w warstwie drugiej ISO\/OSI",
        "ans":"identyfikacja końca i początku ramki w ciągu odebranych bajtów"
    },
    {
        "id":49,
        "que":"Co z otrzymanym datagramem IP adresowanym do hosta 5.5.5.5 zrobi klasowy router IP posiadający w tablicy routowania IP reguły 5.5.0.0\/16 via 1.1.1.1 i 0.0.0.0\/0 via 1.1.1.2",
        "ans":"dopasuje do sieci 5.0.0.0\/8 (bo klasa A), dopasuje do podsieci 5.5.0.0\/16 i przesle na 1.1.1.1 "
    },
    {
        "id":50,
        "que":"Które datagramy zostaną w pierwszej kolejności usuwane przy stosowaniu polityki milk w load shadding?",
        "ans":"Starsze"
    },
    {
        "id":51,
        "que":"Dlaczego fragmenty różnych datagramów IP przesyłanych jednocześnie między parą tych samych hostów IP dalej będą u odbiorcy prawidłowo składane (nie ulegną wymieszaniu)?",
        "ans":"bo mamy w datagramie ipv4 coś takiego jak identyfikator który odpowiada za fragmentację i przynależność do dobrego datagramu?????"
    },
    {
        "id":52,
        "que":"Kiedy ze stacji roboczej pracującej z interfejsem Ethernet wysyłany jest datagram gratitous ARP?",
        "ans":"Włączamy interfejs, zmieniamy jego ip"
    },
    {
        "id":53,
        "que":"Podaj skutki nieprawidłowego skonfigurowania wartości MSS (Maximum segment Size) użytkowanej w protokole TCP",
        "ans":"Gdy MSS będzie zbyt mały – niepotrzebnie rośnie narzut danych związanych z obsługą fragmentacji."
    },
    {
        "id":54,
        "que":"wymień typy funkcjonalności warstwy drugiej ISO\/OSI sieci wykorzystywane w protokole OSPF",
        "ans":"Point-to-point point-to-multipoint"
    },
    {
        "id":55,
        "que":"Wszystkim inferfejsom IP na rysunku nadaj adresację IPv4 w klasie A zgodnie z ogólnie znanymi regułami określając także domyślne bramki dla stacji PC",
        "ans":"(zdjęcie obok)"
    },
    {
        "id":56,
        "que":"Za pomoca odpowiedniego rysunku i jego opisu przedstaw problem powstaawnia pętli routingu dynamicznego występujących w czasie użytkowania tuneli GRE (General Routing Encapsulation) ",
        "ans":"dwa rutery polaczone kreska zwykla czyli kabel, przerywana - tunel GRE i podpisac ze moze wystepowac oscylacja w wyborze trasy"
    },
    {
        "id":57,
        "que":"W przełączniku rootojącym Cisco utworzono 2 sieci VLAN o nr 2 i 4 oraz podłączono do tych sieci po 1 stacji PC. Ponadto stworzono w przełącznikach interfejs VLAN 2 o adresie IP 2.2.2.2\/24 oraz VLAN 4 o IP 4.4.4.4\/24. Zapisz adresy IP interfejsów oraz bramek w stacjach PC aby komunikacje pomiędzy nimi poprzez router w przełączniku Ethernet była możliwa (rysunek na zdjeciu obok)",
        "ans":"?????"
    },
    {
        "id":58,
        "que":"Narysuj schemat instalacji, która umożliwi utworzenie mostka WDS IEE 802.11 z udostępnieniem sieci klientom wraz z usługą automatycznego konfigurowania ich adresów IP. MOżna użyć (?) nadających się do tego urządzeń",
        "ans":"?????"
    },
    {
        "id":59,
        "que":"Ile bajtów danych ze strumienia wejściowego wstawiane jest do bloku definiowanego systemem kodowania 64B66B",
        "ans":"8 (64 bity to 8 bajtów) ???"
    },
    {
        "id":60,
        "que":"Nazwa piątej warstwy modelu ISO\/OSI",
        "ans":"sesji"
    },
    {
        "id":61,
        "que":"Teoretyczna liczba hostów możliwych do umieszczenia w sieci IPv4: 10.10.10.0\/27",
        "ans":"30 \/\/ 2^5 - 2"
    },
    {
        "id":62,
        "que":"Przynajmniej dwa zmodyfikowane (rozszerzone) warianty STP stosowane w przełącznikach Ethernet",
        "ans":"RSTP, MSTP"
    },
    {
        "id":63,
        "que":"Nazwa wtyku stosowanego w portach Ethernet przełączników LAN",
        "ans":"8P8C \/ RJ45"
    },
    {
        "id":64,
        "que":"Cel stosowania SFD w ramkach Ethernet",
        "ans":"Sygnał zakończenia preambuły (synchronizacji)"
    },
    {
        "id":65,
        "que":"Określenie cechy urządzenia sieciowego pozwalającej na wymianę jego modułów bez konieczności wyłączania go",
        "ans":"hot swap"
    },
    {
        "id":66,
        "que":"Adres sieci IPv4 w której znajduje się host 130.130.130.10 przy masce 255.0.0.0",
        "ans":"130.0.0.0"
    },
    {
        "id":67,
        "que":"Cel stosowania preambuły w ramkach Ethernet",
        "ans":"Synchronizacja połączenia"
    },
    {
        "id":68,
        "que":"Nazwa szóstej warstwy modelu ISO\/OSI",
        "ans":"prezentacji"
    },
    {
        "id":69,
        "que":"Komenda Cisco Catalyst IOS przeprowadzająca przełącznik do trybu exec",
        "ans":"enable (en)"
    },
    {
        "id":70,
        "que":"Minimalna długość ramki Ethernet IEEE 802.3",
        "ans":"64 bajty"
    },
    {
        "id":71,
        "que":"Wartość adresu rozgłoszeniowego MAC w Ethernet (hex)",
        "ans":"ff:ff:ff:ff:ff:ff"
    },
    {
        "id":72,
        "que":"Adres broadcast IPv4 dla sieci, w której znajduje się host 110.104.1.1\/8",
        "ans":"110.255.255.255"
    },
    {
        "id":73,
        "que":"Proces polegający na upakowaniu datagramu w innych datagramach - przenoszonych w niższej warstwie Iso OSI",
        "ans":"Enkapsulacja (kapsułkowanie)"
    },
    {
        "id":74,
        "que":"Nazwa przełącznika będącego głównym elementem drzewa STP (w jego kierunku tworzone są ścieżki dla ramek)",
        "ans":"Root Bridge"
    },
    {
        "id":75,
        "que":"Numery przewodów, które należy miejscami zamienić aby otrzymać kabel Twisted Pair z przeplotem (crossed)",
        "ans":"1,2 <-> 3,6 (1z3, 2z6)"
    },
    {
        "id":76,
        "que":"Adres IP broadcast dla sieci IPv4 10.0.0.0 przy masce 255.192.0.0",
        "ans":"10.63.255.255"
    },
    {
        "id":77,
        "que":"Koncentrator Ethernet nie dokonujący analizy adresów MAC w ramkach Ethernet (zawsze rozgłaszający)",
        "ans":"Hub (koncentrator)"
    },
    {
        "id":78,
        "que":"Teoretyczna liczba hostów możliwych do umieszczenia w sieci IPv4 10.10.10.0 przy masce 255.255.255.128",
        "ans":"126 \/\/ wzór: 2^(4*8-25)-2"
    },
    {
        "id":79,
        "que":"Znaczenie pola SFD w ramce Ethernet ",
        "ans":"Sygnał zakończenia preambuły (synchronizacji)"
    },
    {
        "id":80,
        "que":"Znaczenie preambuły w ramce Ethernet",
        "ans":"Synchronizacja połączenia"
    },
    {
        "id":81,
        "que":"Tryby transmisji zakładający przekaz danych jednocześnie w dwóch kierunkach",
        "ans":"Duplex"
    },
    {
        "id":82,
        "que":"Nazwa kabla umożliwiającego konfigurowanie urządzeń firmy Cisco lokalnie (bez używania sieci komputerowej)",
        "ans":"Cisco Console RollOver\/DB9"
    },
    {
        "id":83,
        "que":"Angielska nazwa określająca przepustowość łącza",
        "ans":"Throughput"
    },
    {
        "id":84,
        "que":"Liczba możliwych stanów portu Ethernet w przełączniku (nie licząc stanów definiowanych przez STP i jego modyfikacje)",
        "ans":"4 ??? 2 (up,down) ???"
    },
    {
        "id":85,
        "que":"Rodzaj kabla używanego do tworzenia połączeń Ethernet między przełącznikamij",
        "ans":"Crossover"
    },
    {
        "id":86,
        "que":"Jak nazywa się protokół przeciwdziałający powstawaniu pętli w sieci",
        "ans":"STP (Spanning Tree Protocol)"
    },
    {
        "id":87,
        "que":"Adres sieci IPv4 w której znajduje się host 100.100.12.10\/16",
        "ans":"100.100.0.0"
    },
    {
        "id":88,
        "que":"Adres broadcast IPv4 dla sieci, w której znajduje się host 120.134.12.10\/24",
        "ans":"120.134.12.255"
    },
    {
        "id":89,
        "que":"Maksymalna liczba hostów dla sieci o masce 255.255.252.0",
        "ans":"2^10 - 2 = 1022"
    },
    {
        "id":90,
        "que":"Przekaz w sieci komputerowej dołączony na końcu pakietu lub datagramu, analogiczny znaczeniowo do nagłówka",
        "ans":"trailer"
    },
    {
        "id":91,
        "que":"Tryb transmisji umożliwiający przekaz danych w obie strony, ale nie jednocześnie",
        "ans":"half-duplex"
    },
    {
        "id":92,
        "que":"Wartość najwyższego priorytetu CoS (class of service) w IEEE 802.1p",
        "ans":7
    },
    {
        "id":93,
        "que":"Dowolny przykład poprawnej wartości maski adresu IP",
        "ans":"255.255.0.0"
    },
    {
        "id":94,
        "que":"Nazwa pierwszej warstwy modelu ISO\/OSI",
        "ans":"fizyczna"
    },
    {
        "id":95,
        "que":"Jakikolwiek inny protokół podobny do STP",
        "ans":"TRILL"
    },
    {
        "id":96,
        "que":"Wyróżniamy rodzaje list kontrolnych ACL: standardowe, nazwane(named) oraz ...?",
        "ans":"rozszerzone"
    },
    {
        "id":97,
        "que":"Jakie słowo oznacza pozwolenie przy tworzeniu list ACL",
        "ans":"permit"
    },
    {
        "id":98,
        "que":"Wymień trzy rodzaje wtyków światłowodów.",
        "ans":"SC,LC,ST, FC"
    },
    {
        "id":99,
        "que":"Po której stronie ustala się częstotliwość zegara transmisji. \/ Nazwa koncówki V.35 dla której ustawia się zegar ",
        "ans":"DCE "
    },
    {
        "id":100,
        "que":"Jak nazywa się stan portu zablokowanego przez STP z powodu wykrycia pętli?",
        "ans":"Blocking"
    },
    {
        "id":101,
        "que":"Nazwa portu publicznego, do którego każdy innyport ma dostęp, definiowanego w private VLAN",
        "ans":"promiscuous"
    },
    {
        "id":102,
        "que":"Liczba możliwych klas CoSw VLAN",
        "ans":8
    },
    {
        "id":103,
        "que":"Adres sieci IPv4, w której znajduje sie host 200.200.200.4\/24",
        "ans":"200.200.200.0"
    },
    {
        "id":104,
        "que":"Rodzaj mostkowania Cisco IOS, umozliwiajacy zdefiniowanie w ruterach zarowno rutera jak i mostka ale izolowanych",
        "ans":"CRB"
    },
    {
        "id":105,
        "que":"Z czego sklada sie identyfikator BID przesylany w bramkach BPDU",
        "ans":"bridge priority + mac"
    },
    {
        "id":106,
        "que":"Teoretyczna liczba hostow mozliwych do podlaczenia w sieci 10.10.10.0\/24",
        "ans":254
    },
    {
        "id":107,
        "que":"Numer typu komunikatu OSPF sluzacy do rozglaszania informacji o sciezkach w lokalnym obszarze (area)",
        "ans":2
    },
    {
        "id":108,
        "que":"Nazwa interfejsu wirtualnego w Cisco IOS umożliwiającego dostęp z mostka do rutera w trybie mostkowania IRB",
        "ans":"BVI"
    },
    {
        "id":109,
        "que":"Komenda Cisco Catalyst IOS umozliwiajac przypisanie listy kontrolnej o nr 5 do portu lub linii przelacznika",
        "ans":"ip access-group 5 in"
    },
    {
        "id":110,
        "que":"Wartosc metryki cisco catalyst Administrative distance w tablicy rutowania dla sieci bezposrednio podlaczonych",
        "ans":0
    },
    {
        "id":111,
        "que":"Komenda Cisco Catalyst definiująca tryb pracy portu eternet jako port podlaczony do stacji ip",
        "ans":"switchport mode access"
    },
    {
        "id":112,
        "que":"Zakres standardowych list kontrolnych",
        "ans":"1-99"
    },
    {
        "id":113,
        "que":"Zakres adresow IPv4 w klasie B",
        "ans":"128.0.0.0 - 191.255.255.255"
    },
    {
        "id":114,
        "que":"Wartość IPv4 i maski odpowiadającej wszystkim hostom w internecie",
        "ans":"0.0.0.0\/0"
    },
    {
        "id":115,
        "que":"Co oznacza Time To Live",
        "ans":"czas życia pakietu"
    },
    {
        "id":116,
        "que":"Jakiej klasy jest podany adres IPv4 10.10.10.1",
        "ans":"A"
    },
    {
        "id":117,
        "que":"Angielski odpowiednik terminu: szerokość pasma",
        "ans":"bandwidth"
    },
    {
        "id":118,
        "que":"Adres IPv4 hosta, znajdującego się w sieci 200.200.200.5\/32",
        "ans":"200.200.200.5"
    },
    {
        "id":119,
        "que":"Nazwa portu publicznego (do którego każdy inny port ma dostęp) definiowanego w Private VLANS",
        "ans":"promiscuous"
    },
    {
        "id":120,
        "que":"Liczba bitów przeznaczona na identyfikator VID w VLAN (IEEE 802.1Q)",
        "ans":12
    },
    {
        "id":121,
        "que":"Liczba możliwych klas CoS(IEEE 802.1p) w VLAN",
        "ans":8
    },
    {
        "id":122,
        "que":"Nazwa portu wyłączonego z powodu wykrycia pętli fizycznej przez proces STP w instalacji Ethernet opartej o przełaczniki",
        "ans":"blocking port"
    },
    {
        "id":123,
        "que":"Adres sieci IPv4, w której znajduje się host: 200.200.200.5\/24",
        "ans":"200.200.200.0"
    },
    {
        "id":124,
        "que":"Rozszerzenie Cisco protokołu IGRP",
        "ans":"EiGRP"
    },
    {
        "id":125,
        "que":"Numer typu komunikatu OSPF LSA służący do rozgłaszania informacji o ścieżkach w lokalnym obszarze( area)",
        "ans":2
    },
    {
        "id":126,
        "que":"Adres IPv4 hosta, znajdującego się w sieci: 200.200.200.5\/32",
        "ans":"200.200.200.5"
    },
    {
        "id":127,
        "que":"Komenda do wejścia w konfigurację RIP routera",
        "ans":"router rip"
    },
    {
        "id":128,
        "que":"Nazwa komendy w konsoli Cisco aby wyświetlić tablicę routowania",
        "ans":"sh ip route"
    },
    {
        "id":129,
        "que":"Wzór do obliczania metryki kosztu łacza",
        "ans":"100Mbps\/szybkość interfejsu"
    },
    {
        "id":130,
        "que":"Co oznacza określenie Gateway of last resort",
        "ans":"domyślna bramka"
    },
    {
        "id":131,
        "que":"Wrouterach Cisco wyróżniamy listy ACL nazwane, standardowe i...",
        "ans":"rozszerzone (extended)"
    },
    {
        "id":132,
        "que":"Rozwinięcie akronimu VLSM dla IPv4",
        "ans":"Variable length subnet mask"
    },
    {
        "id":133,
        "que":"Skrót literowy określający listy kontroli dostępu w ruterach i przełącznikach Cisco",
        "ans":"ACL"
    },
    {
        "id":134,
        "que":"Maksymalna wartość VLAN ID",
        "ans":"4095"
    },
    {
        "id":135,
        "que":"Teoretyczna liczba hostów możliwych do podłączenia w sieci IPv4: 10.10.10.0\/23",
        "ans":"2^9-2=510"
    },
    {
        "id":136,
        "que":"Proces uogólniania adresó sieci IP, do których z rutera prowadzi ta sama ścieżka, stosowany w rutowaniu IP",
        "ans":"Route summarization"
    },
    {
        "id":137,
        "que":"Minimalna kategoria kabla TP dla Gigabit Ethernet",
        "ans":"7 (tak wynika z wikipedii xd) \/ a nie 5e ?"
    },
    {
        "id":138,
        "que":"Komenda Cisco IOS powodująca aktywację procesu rutowania RIP",
        "ans":"router rip"
    },
    {
        "id":139,
        "que":"Komenda Cisco IOS umożliwiająca wyłączenie trybu rutowania IP, które bierze pod uwagę klasy adresów IPv4",
        "ans":"ip classless"
    },
    {
        "id":140,
        "que":"Komenda Cisco IOS definiująca\/aktywująca do edycji dowolnie wybrany podinterfejs w ruterze",
        "ans":"int fa 0\/0.1"
    },
    {
        "id":141,
        "que":"Dwie główne techniki poszukiwania tras stosowane w protokołach rutowania dynamicznego IP",
        "ans":"link-state i distance-vector"
    },
    {
        "id":142,
        "que":"Adres IP broadcast dla sieci 10.128.0.0\/23",
        "ans":"10.128.1.255"
    },
    {
        "id":143,
        "que":"Nazwa obszaru wyizolowanego w rutowaniu dynamicznym IP OSPF",
        "ans":"totally stubby"
    },
    {
        "id":144,
        "que":"Zakres identyfikatorów standardowych list dostępu ACL w Cisco IOS",
        "ans":"1-99"
    },
    {
        "id":145,
        "que":"Ogólne określenie protokołów rutowania dynamicznego wewnątrz Systemu Autonomicznego",
        "ans":"interior"
    },
    {
        "id":146,
        "que":"Co wyraża wartość Time To Live w nagłówku datagramu IP",
        "ans":"liczba przeskoków, no TTL"
    },
    {
        "id":147,
        "que":"Które linie w kablu TP Cat5 należy zamienić aby uzyskać wariant krosowany (z przeplotem).",
        "ans":"1,2 <-> 3,6"
    },
    {
        "id":148,
        "que":"Komenda Cisco IOS umożliwiająca zdefinowanie reguły rutowania statycznego",
        "ans":"ip route"
    },
    {
        "id":149,
        "que":"Proces uogólniania adresów sieci IP, do których z rutera prowadzi ta sama ścieżka, stosowany w rutowaniu IP",
        "ans":"Route summarization"
    },
    {
        "id":150,
        "que":"Nazwa komunikatu rozgłaszango w ramach OSPF przekazujące informacje o ścieżce",
        "ans":"LSA"
    },
    {
        "id":151,
        "que":"Co oznacza określenie Gateway of last resort w tablicy",
        "ans":"domyślna bramka"
    },
    {
        "id":152,
        "que":"Max dlugośc pakietu IP",
        "ans":"64kB"
    },
    {
        "id":153,
        "que":"Rozwinięcie akronimu: VLSM dla sieci IPv4",
        "ans":"Variable Length Subnet Mask"
    },
    {
        "id":154,
        "que":"Podział technik rutowania IP pod kątem interpretowania (bądź nie) klas adresów IP\t",
        "ans":"classful\/classless"
    },
    {
        "id":155,
        "que":"Ogólna nazwa metody blokowania ogłaszania wstecznego w celu eliminowania zapętleń rutowania disctance vector",
        "ans":"split horizon"
    },
    {
        "id":156,
        "que":"Teorytyczna liczba hostów możliwych do umieszczenia w sieci IPv4: 10.10.0.0\/23",
        "ans":"2^9-2=510"
    },
    {
        "id":157,
        "que":"W ruterach Cisco oprócz nazwanych (named) i standardowych (standard) ACL wyróżniamy jeszcze jedne. Jakie?",
        "ans":"rozszerzone (extended)"
    },
    {
        "id":158,
        "que":"Nazwa obszaru (area) wyizolowanego w rutowaniu dynamicznym IP OSPF",
        "ans":"totally stub"
    },
    {
        "id":159,
        "que":"Komenda Cisco IOS powodująca aktywację procesu rutowania RIP w routerze Cisco",
        "ans":"router rip nazwa"
    },
    {
        "id":160,
        "que":"Komenda Cisco IOS umożliwiająca wyłączenie trybu rutowania IP, który bierze pod uwagę klasy adresów IPv4",
        "ans":"ip classless"
    },
    {
        "id":161,
        "que":"Dwie głowne techniki poszukiwania tras w stosowane a protokołach rutowania dynamicznego IP",
        "ans":"link-state, distance-vector"
    },
    {
        "id":162,
        "que":"Liczba typów komunikatów LSA w protokole rutowania dynamicznego IP OSPF\t",
        "ans":"6"
    },
    {
        "id":163,
        "que":"Alternatywa dla PPP, choć nie dostarczająca autentyfikacji węzłów",
        "ans":"HDLC"
    },
    {
        "id":164,
        "que":"IPv6 mapped IPv4",
        "ans":"222.1.41.90 --> ::FFFF:222.1.41.90"
    },
    {
        "id":165,
        "que":"Przykładowy adres IPv6 EUI-64",
        "ans":"2222::1234:56FF:FE78:ABCD"
    },
    {
        "id":166,
        "que":"Komenda Cisco IOS powodująca aktywację procesu rutowania OSPF w routerze Cisco",
        "ans":"router ospf 150 (numer raczej dowolny)"
    },
    {
        "id":167,
        "que":"Komenda Cisco IOS powodująca włączenie rutowania OSPF w ruterze Cisco",
        "ans":"router ospf [nr procesu]"
    },
    {
        "id":168,
        "que":"Liczba grup IP multicast możliwa do rozróżnienia w ramach adresacji IPv4",
        "ans":"2^28"
    },
    {
        "id":169,
        "que":"Przynajmniej dwa tryby funkcjonowania IP Protocol Independent Multicast",
        "ans":"sparse-mode, dense-mode"
    },
    {
        "id":170,
        "que":"Nazwa standardu określającego tagowanie sieci VLAN",
        "ans":"IEEE 802.1Q"
    },
    {
        "id":171,
        "que":"Nazwa protokołu warstwy 2 realizowanego w przełącznikach Ethernet w celu eliminacji pętli połączeń",
        "ans":"STP"
    },
    {
        "id":172,
        "que":"Adres sieci IPv4, w której znajduje się host: 120.134.12.10\/16",
        "ans":"120.134.0.0"
    },
    {
        "id":173,
        "que":"Przynajmniej dwa komuntikaty protokołu IGMP (Internet Group Management Protocol)",
        "ans":"Membership Query, Membership Report"
    },
    {
        "id":174,
        "que":"Nazwa dowolnego protokołu obsługującego w warstwie 2 łącze typu punkt-punkt",
        "ans":"SLIP"
    },
    {
        "id":175,
        "que":"Nazwa protokołu konfigurującego adresy IP hostów",
        "ans":"DHCP"
    },
    {
        "id":176,
        "que":"Do jakiej klasy należy adres IPv4: 10.10.1.1?",
        "ans":"A"
    },
    {
        "id":177,
        "que":"Nazwa 4 warstwy ISO OSI",
        "ans":"transportowa"
    },
    {
        "id":178,
        "que":"Angielskie określenie  na \"od celu do źródła\" dotyczące dynamicznego rutowania multicast transmisja .",
        "ans":"Reverse path forwarding"
    },
    {
        "id":179,
        "que":"inne określenie na PIM dense mode",
        "ans":"push mode"
    },
    {
        "id":180,
        "que":"Router wyróżniony w PIM sparse mode???",
        "ans":"RP (Rendezvous Point)"
    },
    {
        "id":181,
        "que":"Max dlugosc pakietu IP",
        "ans":"64kB"
    },
    {
        "id":182,
        "que":"Organizacja która zajmuje się rozwijaniem internetu???",
        "ans":"RIPE"
    },
    {
        "id":183,
        "que":"Wartość adresu grupy IP multicast wykorzystywanej do komunikacji przez protokół IGMP",
        "ans":"224.0.0.22"
    },
    {
        "id":184,
        "que":"Jak nazywa się atrybut prefiksu (w ) określający lokalnie jakość prefiksu( czy coś takiego generalnie)",
        "ans":"LOCAL-PREFERENCES"
    },
    {
        "id":185,
        "que":"Druga warstwa tcp\/ip",
        "ans":"Internet (model tcp\/ip to nie to samo co iso\/osi https:\/\/pl.wikipedia.org\/wiki\/Model_TCP\/IP)"
    },
    {
        "id":186,
        "que":"Do czego służy gateway of last resort (XD)",
        "ans":"to bramka domyślna "
    },
    {
        "id":187,
        "que":"Nazwa rutera i umożliwiającego podzielenie AS na części w celu redukcji ilości sesji ",
        "ans":"Route Reflector"
    },
    {
        "id":188,
        "que":"atrybut sciezki w BGP",
        "ans":"AS-PATH"
    },
    {
        "id":189,
        "que":"Adres broadcast dla sieci IPv4, w której znajduje się host: 110.104.1.1\/8",
        "ans":"110.255.255.255"
    },
    {
        "id":190,
        "que":"Warinat protokołu RIP kompatybilny z IPv6",
        "ans":"RIPng"
    },
    {
        "id":191,
        "que":"Co oznacza określenie Gateway of Last Resort w tablicy rutowania",
        "ans":"bramka domyślna"
    },
    {
        "id":192,
        "que":"Długość adresu IPv6 w bitach",
        "ans":128
    },
    {
        "id":193,
        "que":"Wartość Administrative Distance w tablicy rutowania rutera Cisco dla ",
        "ans":20
    },
    {
        "id":194,
        "que":"Rozwinięcie akronimu MED (???) jako atrybutu ścieżki w ",
        "ans":"multi-exit discriminator"
    },
    {
        "id":195,
        "que":"Nazwa portu publicznego (do którego każdy inny port ma dostęp) w Private VLANS",
        "ans":"promiscious"
    },
    {
        "id":196,
        "que":"Technika ograniczania rozgłaszania ramek multicast tylko do właściwych portów - stosowana w przełącznikach Ethernet",
        "ans":"IGMP snooping"
    },
    {
        "id":197,
        "que":"Adres sieci IPv4, w której znajduje się host 200.200.200.5\/26",
        "ans":"200.200.200.0"
    },
    {
        "id":198,
        "que":"Rozszerzenie Cisco protkołu IGRP",
        "ans":"EIGRP"
    },
    {
        "id":199,
        "que":"Komenda Cisco IOS powodująca wyświetlenie informacji o Rendezvous Point w trybie sparse IP PIM",
        "ans":"show ip pim rp"
    },
    {
        "id":200,
        "que":"Numer typu komunikatu OSPF LSA służący do rozgłaszania informacji o ścieżkach w danym obszarze (area)",
        "ans":"2"
    },
    {
        "id":201,
        "que":"Wartosc metryki Administrative Distance w tablicy rutowania IP wyznaczana dla sieci bezposrednio podlaczonych",
        "ans":"0"
    },
    {
        "id":202,
        "que":"Adres IPv4 hosta znajdującego się w sieci: 200.200.200.5\/32",
        "ans":"200.200.200.5"
    },
    {
        "id":203,
        "que":"Nazwa routera wyprowadzającego ruch z domeny OSPF do innego Systemu Autonomicznego (AS)",
        "ans":"ASBR"
    },
    {
        "id":204,
        "que":"liczba bitow odpowiadająca za identyfikacje hosta w sieci klasy B",
        "ans":"8*2=16 (podtwierdzone Turkiem)"
    },
    {
        "id":205,
        "que":"Jakie pole jest w ATM UNI a nie ma go w ATM NNI",
        "ans":"GFC (Generic Flow Control)"
    },
    {
        "id":206,
        "que":"Długość pola VCI w ATM  (w bitach)",
        "ans":16
    },
    {
        "id":207,
        "que":"Nazwa warstwy fizycznej sieci SAN - Fibre Channel",
        "ans":"FC0"
    },
    {
        "id":208,
        "que":"Nazwa interfejsu ATM tworzonego między dwoma przełącznikami ATM",
        "ans":"NNI"
    },
    {
        "id":209,
        "que":"Nazwa portu przełącznika Fibre channel, używanego do połączenia do niego portów N innych urządzeń(serwerów)",
        "ans":"Port F"
    },
    {
        "id":210,
        "que":"Nazwa procesu przekazywania wiedzy o trasach pomiędzy różnymi protokołami rutownania dynamicznego",
        "ans":"Redystrybucja"
    },
    {
        "id":211,
        "que":"Wariant protokołu rutowania dynamicznego RIP kompatybilny w IPv6",
        "ans":"RIPng"
    },
    {
        "id":212,
        "que":"Nazwa modułu sprzętowego w przełącznikach Ethernet Cisco używanego do wykrywania zagrożeń w ruchu w sieci",
        "ans":"IDS"
    },
    {
        "id":213,
        "que":"Co oznacza określenie Gateway of let resort w tablicy rutowania",
        "ans":"domyślna trasa rutowania"
    },
    {
        "id":214,
        "que":"Maksymalna liczba bajtów przekazywana w celce ATM",
        "ans":53
    },
    {
        "id":215,
        "que":"Nazwa składowej adresu AESA NASP identyfikującej fizyczny interfejs będący wyjściem z ATM",
        "ans":"ESI"
    },
    {
        "id":216,
        "que":"Określenie dla techniki agregowania łączy w sieciach SAN (Storage Area Networks) w celu zwiększenia przepustowości",
        "ans":"striping"
    },
    {
        "id":217,
        "que":"Nazwa atrybutu w komunikacie o trasie e zawierającego listę AS, przez które trasa przechodzi ",
        "ans":"AS_PATH"
    },
    {
        "id":218,
        "que":"Pole występujące w nagłówku celki ATM UNI, lecz nie występujące w nagłówku celki ATM NNI",
        "ans":"GFC"
    },
    {
        "id":219,
        "que":"Co oznacza NAV w ramce w 802.11",
        "ans":" chodzilo o miliskeundy"
    },
    {
        "id":220,
        "que":"Maksymalna liczba aktywnych stacji typu slave w jednej pikosieci Bluetooth (IEEE 802.15)",
        "ans":7
    },
    {
        "id":221,
        "que":"Określenie karty zawierającej serię interfejsów sieciowych w przełącznikach segmentu CORE",
        "ans":"line-card ?"
    },
    {
        "id":222,
        "que":"Standard IEEE określający tagowane VLAN",
        "ans":"802.1q"
    },
    {
        "id":223,
        "que":"Unikatowy identyfikator opłączenia w technologii Frame Relay (w warstwie 2 ISO OSI)",
        "ans":"DLCI (Data-Link Connection Identifier)"
    },
    {
        "id":224,
        "que":"Wartość Administrative Distance dla e",
        "ans":20
    },
    {
        "id":225,
        "que":"Skrót literowy oznaczający usługę telefonii analogowej",
        "ans":"POTS"
    },
    {
        "id":226,
        "que":"Rozwinięcie akronimu CPE jako określenia komunikacji w asymetrycznych lub symetrycznych DSL",
        "ans":"Customer-Premises Equipment"
    },
    {
        "id":227,
        "que":"Maksymalna liczba aktywnych sesji typu slave w jednej pikosieci Bluetooth (IEEE 802.15) (Bluetooth)",
        "ans":"1*Master + 7* Slave"
    },
    {
        "id":228,
        "que":"",
        "ans":"line card"
    },
    {
        "id":229,
        "que":"Określenie dla obowiązkowych atrybutów ścieżki ",
        "ans":"Well-known Mandatory"
    },
    {
        "id":230,
        "que":"Unikatowy identyfikator połączenia w technologii Frame Relay (w warstwie 2 IOS OSI)",
        "ans":"DLCI (Data-Link Connection Identifier)"
    },
    {
        "id":231,
        "que":"Wartość Administrative Distance dla ebgp",
        "ans":20
    },
    {
        "id":232,
        "que":"Nazwa instytucji zajmującej się zarządzaniem Systemami Autonomicznymi i  w Europie",
        "ans":"RIPE"
    },
    {
        "id":233,
        "que":"liczba możliwych klas QoS (IEEE 802,1p) w VLAN",
        "ans":8
    },
    {
        "id":234,
        "que":"Komenda Cisco Catalyst IOS przeprowadzająca konsolę z trybu nieuprzywilejowanego do trybu exec",
        "ans":"enable (skrót: en)"
    },
    {
        "id":235,
        "que":"Numery przewodów, które należy zamienić miejscami aby otrzymać kabel z przeplotem",
        "ans":"1,2 <-> 3,6"
    },
    {
        "id":236,
        "que":"Protokół drugiej warstwy pracujący w przełącznikach Ethernet i zabezpieczający sieć przed powstaniem pętli",
        "ans":"stp"
    },
    {
        "id":237,
        "que":"Nazwa numeru portu przełącznika Ethernet, który zgodnie z nomenkulaturą protokołu STP prowadzi do Root Bridge",
        "ans":"Root Port"
    },
    {
        "id":238,
        "que":"Adres sieci, w której znajduje się host 120.121.1.1 przy masce 255.254.0.0",
        "ans":"120.120.0.0   <= polecam http:\/\/haker.com.pl\/threads\/22217-TUTORIAL-Przeliczanie-Adres%C3%B3w-Ip-Maska-Broadcast-etc-IPv4"
    },
    {
        "id":239,
        "que":"Komenda CCIOS przeprowadzająca konsolę z trybu exec do trybu umożliwiającego konfigurację ustawień",
        "ans":"configure terminal (conf t)"
    },
    {
        "id":240,
        "que":"Liczba maksymalna hostów możliwa do zdefiniowania w sieci 200.200.200.0 przy mascie 255.255.255.192",
        "ans":"62   <=2^(4*8-26)-2 \/\/ a nie 64?(maska zostawia ci 6 bitow wolnych)\/\/ edit kolejny, 2 sa zajete przez broadcast i network ip"
    },
    {
        "id":241,
        "que":"Nazwy kategorii linii komunikacyjnych (line) definiowanych w systemie CCIOS",
        "ans":"vty\/console"
    },
    {
        "id":242,
        "que":"Angielski odpowiednik słowa: przepustowość dla łącza sieciowego",
        "ans":"throughput"
    },
    {
        "id":243,
        "que":"Koncentrator Ethernet nie dokonujący analizy adresów MAC (zawsze rozgłaszający)",
        "ans":"hub"
    },
    {
        "id":244,
        "que":"Liczba bitów o wartości 0 w masce adresu IPv4 w notacji CIDR: 200.200.200.1 i masce 255.255.255.0",
        "ans":"8"
    },
    {
        "id":245,
        "que":"Nazwa protokołu konfigurującego adresy IP hostów w sieci",
        "ans":"DHCP"
    },
    {
        "id":246,
        "que":"Liczba bitów w adresie Ethernet MAC",
        "ans":48
    },
    {
        "id":247,
        "que":"Liczba bitów w adresie Ethernet IP",
        "ans":32
    },
    {
        "id":248,
        "que":"Nazwa piątej warstwy modelu ISO OSI",
        "ans":"sesji"
    },
    {
        "id":249,
        "que":"Adres IP Broadcast dla sieci IPv4: 10.0.0.0 przy masce 255.128.0.0",
        "ans":"10.127.255.255"
    },
    {
        "id":250,
        "que":"Angielski odpowiednik terminu: Szerokość pasma",
        "ans":"bandwidth"
    },
    {
        "id":251,
        "que":"Dwie techniki transmisji strumienia bitów rozróżniane z uwagi na obecność (lub nie) przekazu informacji zegarującej",
        "ans":"Komunikacja synchroniczna i asynchroniczna \/\/\/\/\/ ??????????????????????????????????"
    },
    {
        "id":252,
        "que":"Adres segmentu sieci IPv4, do której należy host o adresie IPv4: 10.10.10.10 przy masce 255.255.192.0",
        "ans":"10.10.0.0"
    },
    {
        "id":253,
        "que":"Maksymalna długość kabla TP Cat5 (skrętki) pomiędzy przełącznikami w technologii Ethernet",
        "ans":"100 metrów"
    },
    {
        "id":254,
        "que":"Adres IP broadcast dla sieci IPv4: 10.10.0.0 przy masce 255.255.0.0",
        "ans":"10.10.255.255"
    },
    {
        "id":255,
        "que":"Rodzaje portów zapasowych w stanie discarding określane przez protokół RSTP w przełącznikach Ethernet (IEEE 802.1w)",
        "ans":"Alternate port;  backup port;"
    },
    {
        "id":256,
        "que":"Jednostka, w której określona jest szerokość pasma dla danego medium transmisyjnego",
        "ans":"bps (bits per second)"
    },
    {
        "id":257,
        "que":"Funkcja protokołu VTP usuwająca VLAN Trunks, gdy dany VLAN w zadanym przełączniku nie ma żadnych portów",
        "ans":"Pruning"
    },
    {
        "id":258,
        "que":"Wartość identyfikatora(VID) domyślnej sieci VLAN w przełącznikach Cisco( przy ustawieniach fabrycznych)",
        "ans":"1 ??? Tak, slajd 21 z drugiej prezentacji"
    },
    {
        "id":259,
        "que":"Minimalna długość ramki Ethernet IEEE 802.3(w bajtach)",
        "ans":"64(?)"
    },
    {
        "id":260,
        "que":"Klasa adresu IPv4:200.200.200.1",
        "ans":"Klasa C"
    },
    {
        "id":261,
        "que":"Komenda Cisco Catalyst iOS przeprowadzająca przełącznik do trybu konfiguracji vlan numer 3",
        "ans":"interface vlan 3"
    },
    {
        "id":262,
        "que":"Technologia Ethernet umożliwiająca tunelowanie wielu VLAN TRUNK w jednym łączu",
        "ans":"802.1 Q-in-Q"
    },
    {
        "id":263,
        "que":"Rodzaj światłowodu umożliwiającego przesyłanie  jednocześnie tylko jednej wiązki światła danej częstotliwości",
        "ans":"jednomodowy"
    },
    {
        "id":264,
        "que":"Adres IP broadcast dla sieci IPv4: 10.10.0.0\/16        ",
        "ans":"10.10.255.255"
    },
    {
        "id":265,
        "que":"Maksymalna długość ramki IEEE 802.1Q",
        "ans":"1522B "
    },
    {
        "id":266,
        "que":"Komenda Cisco Catalyst definiująca tryb pracy przełącznika jako trunk IEEE 802.1Q",
        "ans":"Switch(config-if)#switchport mode trunk"
    },
    {
        "id":267,
        "que":"Rodzaje portów zapasowych  stanie discarding  określane przez protokół RSTP w przełącznikach Ethernet (IEEE 802.1w)",
        "ans":"Alternate Port, Backup Port"
    },
    {
        "id":268,
        "que":"Tryb transmisji, umożliwiający ruch tylko w jednym kierunku",
        "ans":"Simplex"
    },
    {
        "id":269,
        "que":"Komenda Cisco Catalyst IOS przeprowadzająca przełącznik do trybu konfiguracji vlan numer 3",
        "ans":"interface vlan 3 \/\/raczej samo vlan3,int vlan3 tworzy interfejs"
    },
    {
        "id":270,
        "que":"Maksymalna długość kabla TP Cat 5 (skrętki) pomiędzy przełącznikami w technologii Ethernet",
        "ans":"100m"
    },
    {
        "id":271,
        "que":"Adres IP Broadcast dla sieci IPv4 10.10.0.0\/16",
        "ans":"10.10.255.255."
    },
    {
        "id":272,
        "que":"Technologia Ethernet umożliwiająca tunelowanie wielu VLAN TRUNK w jednym złączu fizycznym",
        "ans":"Q-in-Q"
    },
    {
        "id":273,
        "que":"Komenta CCIOS definiująca tryb pracy przełącznika jako trunk IEEE 802.1Q",
        "ans":"switchport mode trunk"
    },
    {
        "id":274,
        "que":"Maksymalna długość pakietu Ethernet",
        "ans":"1518 - ej ej, a nie 1522??"
    },
    {
        "id":275,
        "que":"Tryb transmisji w medium dopuszczającym obydwa kierunki przepływu danych",
        "ans":"Duplex"
    },
    {
        "id":276,
        "que":"Adres sieci IPv4, w której znajduje się host 100.100.13.10\/23",
        "ans":"100.100.12.0"
    },
    {
        "id":277,
        "que":"Teoretyczna liczba hostów możliwych do umieszczenia w sieci IPv4 10.10.10.0\/29",
        "ans":"6"
    },
    {
        "id":278,
        "que":"Wartość adresu rozgłoszeniowego MAC w Ethernet(hex)",
        "ans":"ff:ff:ff:ff:ff:ff"
    },
    {
        "id":279,
        "que":"Rodzaje topologii logicznej sieci komputerowej",
        "ans":"rozgłaszania\/przekazywania tokenu"
    },
    {
        "id":280,
        "que":"Liczba bitów przeznaczona na VID w VLAN (IEEE 802.1Q)",
        "ans":"12"
    },
    {
        "id":281,
        "que":"Nazwa portu publicznego (do którego każdy inny ma dostęp) definiowanego w Private VLANs przełącznika Ethernet",
        "ans":"Promiscuous"
    },
    {
        "id":282,
        "que":"Nazwa pierwszej warstwy modelu ISO OSI",
        "ans":"Fizyczna"
    },
    {
        "id":283,
        "que":"Komenda CCIOS trybu config aktywująca tryb konfigurowania linii terminali wirtualnych o numerach 0-4",
        "ans":"line vty 0 - 4 (spacje koło myślnika!!) -- ŹLE!!!! ma byc \"line vty 0 4\" (sama spacja) - sprawdzane w CPT - jest w sprawku 022"
    },
    {
        "id":284,
        "que":"Nazwy dwóch podwarstw 2 warstwy ISO OSI",
        "ans":"LLC MAC"
    },
    {
        "id":285,
        "que":"Nazwa standardu określająca tagowanie sieci VLAN",
        "ans":"802.1Q"
    },
    {
        "id":286,
        "que":"Liczba bitów w adresie IPv4",
        "ans":"32"
    },
    {
        "id":287,
        "que":"Komenda CCIOS określająca tryb pracy portu Ethernet jako obsługującego pojedynczego hosta (np PC)",
        "ans":"switchport mode access"
    },
    {
        "id":288,
        "que":"Przynajmniej dwie kategorie kabla Twisted Pair",
        "ans":"5\/5e\/6"
    },
    {
        "id":289,
        "que":"Adres sieci IPv4, w której znajduje się host 100.100.12.10\/16",
        "ans":"100.100.0.0"
    },
    {
        "id":290,
        "que":"Maksymalna liczba hostów przy masce 255.255.252.0",
        "ans":"2^10 - 2 = 1022"
    },
    {
        "id":291,
        "que":"Topologia sieci Ethernet oparta o jeden koncentrator (przełącznik)",
        "ans":"Gwiazdy"
    },
    {
        "id":292,
        "que":"Tryb transmisji umożliwiający przekaz danych w obie strony ale nie jednocześnie",
        "ans":"Half-duplex"
    },
    {
        "id":293,
        "que":"Znaczenie preambuły wysyłanej przed ramką Ethernet",
        "ans":"Synchronizacja"
    },
    {
        "id":294,
        "que":"Wariant sieci Ethernet VLAN, gdzie połączenie izolowane wielu VLAN w dwóch przełącznikach wielu kabli TP",
        "ans":"port based"
    },
    {
        "id":295,
        "que":"Teoretyczna liczba hostów możliwych do podłączenia do sieci IPv4 10.10.10.0\/25",
        "ans":"126"
    },
    {
        "id":296,
        "que":"Wartość najwyższego priorytetu Class of Service w IEEE 802.1p",
        "ans":7
    },
    {
        "id":297,
        "que":"Tryb pracy VTP, w którym datagramy są jedynie przekazywane dalej",
        "ans":"Transparent"
    },
    {
        "id":298,
        "que":"Scalenie kilku łącz TP pomiędzy przełącznikami Ethernet w jeden kanał o zwielokrotnionej przepustowości",
        "ans":"EtherChannel"
    },
    {
        "id":299,
        "que":"Dowolny przykład notacji CIDR adresu IP",
        "ans":"1.1.1.1\/1"
    },
    {
        "id":300,
        "que":"Komenda CCIOS aktywująca tryb pracy trunk portu przełącznika Ethernet",
        "ans":"switchport mode trunk"
    },
    {
        "id":301,
        "que":"Adres sieci IPv4, w której znajduje się host 120.134.12.10\/16",
        "ans":"120.134.0.0"
    },
    {
        "id":302,
        "que":"Adres broadcast IPv4 dla sieci, w której znajduje się host 120.134.12.10\/8",
        "ans":"120.255.255.255"
    },
    {
        "id":303,
        "que":"Maksymalna liczba hostów przy masce 255.255.224.0",
        "ans":" (255-224+1)*(255+1)-2=8190 ? ##"
    },
    {
        "id":304,
        "que":"Komenda CCIOS umożliwiająca zdefiniowanie rozpoznawalnej w sieci nazwy przełącznika Cisco Catalyst",
        "ans":"hostname?"
    },
    {
        "id":305,
        "que":"Informacja dołączona na końcu pakietu\/datagramu analogiczna znaczeniowo do nagłówka",
        "ans":"Trailer"
    },
    {
        "id":306,
        "que":"Nazwa protokołu zdalnie konfigurującego adresy IP hostów w sieci",
        "ans":"DHCP"
    },
    {
        "id":307,
        "que":"W jakim rodzaju pamięci wewnętrznej przełącznika Ethernet Cisco trzymany jest trwale obraz jego systemu operacyjnego",
        "ans":"flash? (a nie NVRAM?)"
    },
    {
        "id":308,
        "que":"Komenda CCIOS umożliwiająca przypisanie listy kontrolnej (ACL) numer 5 do portu lub linii przełącznika",
        "ans":"Ruter(config-if)#ip access-group 5 in \/\/ Ruter(config-line)#access-class 5 in"
    },
    {
        "id":309,
        "que":"Topologia sieci Ethernet oparta o jeden koncentrator(przełącznik)",
        "ans":"Gwiazdy"
    },
    {
        "id":310,
        "que":"Nazwa wtyku stosowanego do łączenia portów Ethernet w przełącznikach z użyciem kabla TP",
        "ans":"RJ45(8p8c)"
    },
    {
        "id":311,
        "que":"Nazwa siódmej warstwy ISO OSI",
        "ans":"Aplikacji"
    },
    {
        "id":312,
        "que":"Komenda CCIOS umożliwiająca wyświetlenie danych zgromadzonych w ramach protokołu STP",
        "ans":"show spanning-tree"
    },
    {
        "id":313,
        "que":"W jakim rodzaju pamięci przełączniki Ethernet Cisco zapisują swoją konfigurację",
        "ans":"flash "
    },
    {
        "id":314,
        "que":"Adres sieci IPv4, w której znajduje się host 130.130.130.10\/8",
        "ans":"130.0.0.0 "
    },
    {
        "id":315,
        "que":"Maksymalna liczba hostów w sieci o masce 255.255.255.255",
        "ans":"1 (tak, maska jest prawidłowa)"
    },
    {
        "id":316,
        "que":"Podać maksymalną długość pakietu IP. ",
        "ans":"64kB"
    },
    {
        "id":317,
        "que":"Wariant sieci Ethernet VLAN, gdzie połączenie izolowane wielu VLAN w dwóch przełącznikach wymaga wielu kabli TP",
        "ans":"port based"
    },
    {
        "id":318,
        "que":"Co określa standard IEEE 802.1ad",
        "ans":"Technikę tunelowania wielu VLAN Trunks w jednym łączu fizycznym (Q-in-Q)"
    },
    {
        "id":319,
        "que":"Zbiór wszystkich hostów z sieci 200.200.0.0\/16 zapisany w notacji stosowanej przy definiowaniu ACL w Cisco IOS",
        "ans":"200.200.0.0    0.0.255.255"
    },
    {
        "id":320,
        "que":"Proces polegający na upakowaniu datagramu w innych datagramach - przenoszony w niższej warstwie ISO OSI",
        "ans":"enkapsulacja"
    },
    {
        "id":321,
        "que":"Zakres identyfikatorów standardowych list dostępu (ACL) w Cisco IOS",
        "ans":"1-99"
    },
    {
        "id":322,
        "que":"Tryb funkcjonowania łącza HDLC angażujący jest jeden terminal primary i jeden lub więcej terminali secondary",
        "ans":"unbalanced"
    },
    {
        "id":323,
        "que":"Skrót literowy określający listy kontroli dostępu w routerach i przełącznikach Cisco",
        "ans":"ACL"
    },
    {
        "id":324,
        "que":"Nazwa portu Private VLAN umożliwiającego wyłącznie komunikowanie z portem Promiscuous",
        "ans":"Isolated Port"
    },
    {
        "id":325,
        "que":"Rodzaje list kontrolnych (ACL) w Cisco IOS",
        "ans":"Standardowe \\ Rozszerzone \\ Nazwane"
    },
    {
        "id":326,
        "que":"Przynajmniej dwa zmodyfikowane warianty STP stosowane w przełącznikach Ethernet",
        "ans":"RSTP, MSTP"
    },
    {
        "id":327,
        "que":"Rozszerzenie Cisco protokołu iGRP",
        "ans":"EiGRP"
    },
    {
        "id":328,
        "que":"Komenda Cisco IOS umożliwiająca sprawdzenie zawartości tablicy rutowania w ruterze Cisco",
        "ans":"show ip route"
    },
    {
        "id":329,
        "que":"Wartość Administrative Distance w tablicy rutowania routera Cisco dla iBGP",
        "ans":"200"
    },
    {
        "id":330,
        "que":"Nazwa obszru (area) w rutowaniu dynamicznym IP OSPF, który nie otrzymuje informacji spoza domeny OSPF",
        "ans":"Stub area"
    },
    {
        "id":331,
        "que":"Komenda umożliwiająca wyłączenie trybu routowania IP, który bierze pod uwagę klasy adresów IPv4",
        "ans":"ip classless"
    },
    {
        "id":332,
        "que":"Z czego składa się identyfikator BID (Bridge-ID) przesyłany w ramkach BPDU definiowanych przez protokół STP (802.1d)",
        "ans":"bridge priority + MAC"
    },
    {
        "id":333,
        "que":"Numer typu komunikatu OSPF LSA służący do rozgłaszania informacji o ścieżkach w lokalnym obszarze (area)",
        "ans":2
    },
    {
        "id":334,
        "que":"Tryb rutowania IP, w którym nastąpi rozgłoszenie datagramu IP do ściśle określonej puli zarejestrowanych odbiorców",
        "ans":"multicast"
    },
    {
        "id":335,
        "que":"Ogólna nazwa metody blokowania ogłaszania wstecznego w celu eliminowania zapętleń rutowania distance vector",
        "ans":"split horizon"
    },
    {
        "id":336,
        "que":"Komenda CCIOS definiująca tryb pracy portu Ethernet przełącznika jako \"port podłączony do stacji PC\"",
        "ans":"switchport mode access"
    },
    {
        "id":337,
        "que":"Ogólne określenie protokołów rutowania dynamicznego wewnątrz Systemy Autonomicznego",
        "ans":"IGP"
    },
    {
        "id":338,
        "que":"Minimalna kategoria kabla TP (Twisted Pair) dla Gigabit Ethernet",
        "ans":"5e"
    },
    {
        "id":339,
        "que":"Przynajmniej trzy typy wtyków światłowodowych",
        "ans":"SC,LC,ST"
    },
    {
        "id":340,
        "que":"Alternatywa dla protokołu HDLC",
        "ans":"PPP"
    },
    {
        "id":341,
        "que":"Po której stronie łącza V.35 serial należy dostarczyć zegar",
        "ans":"DCE"
    },
    {
        "id":342,
        "que":"Maksymalna długość ramki IEEE 802.3 (w oktetach)",
        "ans":1518
    },
    {
        "id":343,
        "que":"W których warstwach modelu OSI operuje urządzenie: ruter IP",
        "ans":"moim zdaniem sama 3 (1-3, pytałem się Turka)"
    },
    {
        "id":344,
        "que":"Nazwa dowolnego protokołu obsługującego w warstwie 2 łącze typu punkt-punkt (point-to-point)",
        "ans":"SLIP"
    },
    {
        "id":345,
        "que":"Komenda CCIOS powodująca włączenie rutowania OSPF w ruterze Cisco",
        "ans":"#router ospf id_ospf_process (1..65536)\/ router ospf 150"
    },
    {
        "id":346,
        "que":"jakie  znaczenie ma SFD w ramce Ethernet?",
        "ans":"synchronizacja(uznał taką odp) \/\/SFD (Start Frame Delimiter) SFD jest sekwencją 8 bitów w postaci 10101011, która wskazuje na początek ramki Ethernet z danymi."
    },
    {
        "id":347,
        "que":"Przynajmniej dwa tryby funkcjonowania IP protocol independent multicast",
        "ans":"PIM sparse mode, PIM dense mode"
    },
    {
        "id":348,
        "que":"Przynajmniej dwa komunikaty protokołu IGMP",
        "ans":"\"membership query\", \"membership report\""
    },
    {
        "id":349,
        "que":"Komenda CCIOS umożliwiająca włączenie routowania OSPF w routerze Cisco",
        "ans":"#router ospf id_ospf_process (1..65536)\/ router ospf 150"
    },
    {
        "id":350,
        "que":"Liczba grup IP multicast możliwa do utworzenia(nieczytelne słowo, ale chyba o to chodzi?) w ramach adresacji IPv4",
        "ans":"2^28"
    },
    {
        "id":351,
        "que":"Komenda CCIOS umożliwiająca sprawdzenie zawartości tablicy routowania",
        "ans":"show ip route"
    },
    {
        "id":352,
        "que":"Wariant OSPF, który umożlwia multicast",
        "ans":"MOSPF"
    },
    {
        "id":353,
        "que":"Zapisz adres IPv6 6A2E:0:0:0:0:0:0:A25E w notacji skrótowej",
        "ans":"6A2E::A25E"
    },
    {
        "id":354,
        "que":"Podział protokołów rutowania dynamicznego pod kątem technik wyznaczania tras i składowanie informacji o nich",
        "ans":"link state, distance vector"
    },
    {
        "id":355,
        "que":"Wartość adresu IPv6 i maski (w odpowiedniej notacji) określająca wszystkie hosty w internecie",
        "ans":"::\/0"
    },
    {
        "id":356,
        "que":"Nazwa pierwszej warstwy Internet Protocol Suite",
        "ans":"link"
    },
    {
        "id":357,
        "que":"Nazwa trzeciej warstwy Internet Protocol Suite",
        "ans":"transport"
    },
    {
        "id":358,
        "que":"Nazwa czwartej warstwy Internet Protocol Suite",
        "ans":"application"
    },
    {
        "id":359,
        "que":"Długość (liczba bitów) identyfikatora systemu autonomicznego (AS) rutowania IP",
        "ans":16
    },
    {
        "id":360,
        "que":"Adres IPv6 będący odpowiednikiem adresu IPv4 1.255.0.254 w notacji IPv6-mapped-IPv4",
        "ans":"::FFFF:1.255.0.254\/96"
    },
    {
        "id":361,
        "que":"Ogólna nazwa protokołów rutowania dynamicznego operujących jednocześnie w wielu systemach autonomicznych (AS)",
        "ans":"EGP"
    },
    {
        "id":362,
        "que":"Komenda Cisco IOS definiująca\/aktywująca do edycji dowolnie wybrany podinterfejs w ruterze Cisco",
        "ans":"int fa0\/0.1"
    },
    {
        "id":363,
        "que":"Nazwa sieci IP podłączonej bezpośrednio do rutera",
        "ans":"Sieć ościenna (directly connected network)"
    },
    {
        "id":364,
        "que":"Ogólne określenie protokołów rutowania dynamicznego wewnątrz systemu autonomicznego",
        "ans":"IGP"
    },
    {
        "id":365,
        "que":"Zakres unikatowych lokalnych nierutowalnych IPv6",
        "ans":"FC00::\/7"
    },
    {
        "id":366,
        "que":"Określenie rodzaju adresów IP stosowane w NAT dla adresów w datagramach w sieci prywatnej (inside)",
        "ans":"local"
    },
    {
        "id":367,
        "que":"Odpowiednik IPv4 adresu IPv6 0:0:0:0:0:0:0:1",
        "ans":"127.0.0.1"
    },
    {
        "id":368,
        "que":"Wartość adresu autokonfiguracji IPv6 (nadawanego samoczynnie przez stację, np. przy braku dostępu do DHCP)",
        "ans":"fe80::\/10"
    },
    {
        "id":369,
        "que":"Długość (liczba bitów) identyfikatora EUI (Extended Unique Identifier) w IPv6",
        "ans":64
    },
    {
        "id":370,
        "que":"Liczba bitów pola TTL w nagłówku datagramu IPv4",
        "ans":"8"
    },
    {
        "id":371,
        "que":"Komenda Cisco IOS umożliwiająca sprawdzenie zawartości tablicy rutowania dla IPv6 w ruterze Cisco",
        "ans":"show ipv6 route"
    },
    {
        "id":372,
        "que":"Komenda kasująca pamięć NVRAM rutera",
        "ans":"write erase"
    },
    {
        "id":373,
        "que":"Wartość Administrative Distance dla eBGP",
        "ans":"20"
    },
    {
        "id":374,
        "que":"Wzór do obliczenia metryki kosztu łącza w protokole OSPF",
        "ans":"100Mbps\/szybkość interfejsu"
    },
    {
        "id":375,
        "que":"Maksymalna liczba przeskoków przez rutery pomiędzy sąsiadami BGP w różnych AS (dla eBGP)",
        "ans":"1"
    },
    {
        "id":376,
        "que":"Zakres indentyfikatorów AS BGP przeznaczony do diagnostyki i eksperymentów",
        "ans":"65001-65535"
    },
    {
        "id":377,
        "que":"Określenie w technologii NAT dla adresów IP w datagramach IP przekazywanych przez sieci outside",
        "ans":"global"
    },
    {
        "id":378,
        "que":"Nazwa komunikowania ruterów iGRP zakładające tworzenie wewnątrz AS połączeń (sesji) BGP \"każdy z każdym\"",
        "ans":"Full mesh"
    },
    {
        "id":379,
        "que":"Wartośc adresu IPv6 i maski (w odpowiedniej notacji) określająca wszystkie hosty w Internecie",
        "ans":"::\/0"
    },
    {
        "id":380,
        "que":"Komenda Cisco IOS umożliwiająca wyłączenie uogólniania tras przekazywanych w protokołach rutowania dynamicznego",
        "ans":"no ip summary-address NAZWA_PROTOKOŁU NUMER_AS IP MASKA"
    },
    {
        "id":381,
        "que":"Co zawiera Extended Unique Identifier w adresie IPv6?",
        "ans":"zawiera MAC uzupełniony wartością 0xFFFE pośrodku np. 00:0C:29:FF:FE:0C:47:D5"
    },
    {
        "id":382,
        "que":"Technika umożliwiająca stworzenie relacji jeden-do-wielu pomiędzy adresami IP w NAT",
        "ans":"overloading"
    },
    {
        "id":383,
        "que":"Nazwa techniki utrzymywania kilku alternatywnych tras BGP wychodzących z danego AS",
        "ans":"multihoming"
    },
    {
        "id":384,
        "que":"Zapisz dowolny adres IPv6 w notacji EUI-64",
        "ans":"1::\/64 eui-64"
    },
    {
        "id":385,
        "que":"Nazwa techniki (w Cisco IOS) umożliwiającej wykorzystanie kontrolnych ACL do kontroli procesu rutowania dynamicznego",
        "ans":"ROUTE-MAP"
    },
    {
        "id":386,
        "que":"Ruter iBGP mający prawo otrzymywania komunikatów o lokalnych trasach od rutera BGP Route Reflector (RR)",
        "ans":"RRC - Route reflector client"
    },
    {
        "id":387,
        "que":"komenda wypisująca dla multicasta route (rutowanie)",
        "ans":"show ip mroute"
    },
    {
        "id":388,
        "que":"Nazwa interfejsu ATM tworzonego pomiędzy dwoma przełącznikami ATM",
        "ans":"NNI"
    },
    {
        "id":389,
        "que":"Nazwa konstrukcji w iGBP zakładająca tworzenie wewnątrz AS połączeń BGP \"każdy z każdym\"",
        "ans":"Full mesh"
    },
    {
        "id":390,
        "que":"Technika umożliwiająca w Cisco IOS stworzenie relacji jeden-do-wielu pomiędzy adresami IP w NAT",
        "ans":"overloading"
    },
    {
        "id":391,
        "que":"Unikatowy identyfikator połączenia w technologii Frame Relay",
        "ans":"DLCI"
    },
    {
        "id":392,
        "que":"Nazwa interfejsu ATM tworzonego pomiędzy przełącznikiem ATM a ruterem-bramką z sieci ATM",
        "ans":"UNI"
    },
    {
        "id":393,
        "que":"Nazwa techniki definiowania kilku tras BGP z danego AS - z dopuszczeniem wyboru pomiędzy nimi",
        "ans":"multihoming"
    },
    {
        "id":394,
        "que":"Nazwa techniki w Ciscio IOS umożliwiającej wykorzystanie ACL do kontroli procesu rutowania dynamicznego",
        "ans":"route-map"
    },
    {
        "id":395,
        "que":"Długość pakietu UDP (coś takiego) ",
        "ans":"65535`"
    },
    {
        "id":396,
        "que":"Co to jest gateway of last resort?",
        "ans":"Brama domyślna"
    },
    {
        "id":397,
        "que":"Adres CIDR dla SIECI IPv4 IP 100.100.100.1 255.255.0.0",
        "ans":"100.100.0.0\/16"
    },
    {
        "id":398,
        "que":"Europejski odpowiednik standardu T-Carrier",
        "ans":"E-Carrier"
    },
    {
        "id":399,
        "que":"Komenda Cisco aktywująca w routerze routowanie BGP dla AS o wartości 100",
        "ans":"router bgp 100"
    },
    {
        "id":400,
        "que":"Długość (w bitach) identyfikatora DLCI we Frame Relay",
        "ans":"10 bitów?"
    },
    {
        "id":401,
        "que":"Nazwa komunikatu rozgłaszanego w OSPF przekazującego informację o ścieżce",
        "ans":"LSA"
    },
    {
        "id":402,
        "que":"Wewnątrz jakiej jednostki logicznej agregowane są wirtualne kanały ATM",
        "ans":"Virtual Path Connection (raczej Channel)"
    },
    {
        "id":403,
        "que":"Długość adresu AESA NSAP ATM",
        "ans":"20 bajtów (odp w pytaniu)"
    },
    {
        "id":404,
        "que":"Parametry tras BGP, które można modyfikować w ramach route-maps",
        "ans":"WEIGHT, LOCAL_PREFERENCE i MED"
    },
    {
        "id":405,
        "que":"Nazwa rutera iBGP umożliwiającego podzielenie AS na części w celu redukcji ilości sesji BGP",
        "ans":"Route Reflector"
    },
    {
        "id":406,
        "que":"Parametr określający przepustowość gwarantowaną w danej chwili czasowej przez dostawcę - w technologii Frame Relay",
        "ans":"CIR"
    },
    {
        "id":407,
        "que":"Wartość (w protokole IP) maksymalnego opóźnienia dla dostarczenia pakietu IP do odbiorcy",
        "ans":"brak (\"Nie jest definiowane opóźnienie maksymalne – ewentualny timeout\ndla usługi określany jest w warstwach wyższych\")"
    },
    {
        "id":408,
        "que":"Rozwinięcie skrótu SDH",
        "ans":"Synchronous Digital Hierarchy"
    },
    {
        "id":409,
        "que":"Określenie w technologii NAT adresów IP w datagramach IP w sieci typu outside",
        "ans":"global"
    },
    {
        "id":410,
        "que":"Ruter iBGP mający prawo otrzymywania komunikatów o lokalnych trasach od rutera BGP Router Reflector",
        "ans":"RRC"
    },
    {
        "id":411,
        "que":"Dwa identyfikatory w ATM, służące do znajdywania ścieżki (adresu).",
        "ans":"VCI i VPI"
    },
    {
        "id":412,
        "que":"Rozwinięcia skrótu MPoA jako technologii stosowanej w ATM",
        "ans":"Multiprotocol over ATM"
    },
    {
        "id":413,
        "que":"rodzaje warstw ATM Adaptation Layers",
        "ans":"5 wersji: AAL Type 0; AAL Type 1; AAL Type 2; AAL Type 3\/4; AAL Type 5"
    },
    {
        "id":414,
        "que":"Nazwa typu interfejsu umożliwiającego zarządzanie modemem w Cisco IOS",
        "ans":"Dialer"
    },
    {
        "id":415,
        "que":"Port przeznaczony do obsługi VLAN TRUNK w przełącznikach Ethernet firmy HP",
        "ans":"tagged"
    },
    {
        "id":416,
        "que":"Nazwa systemu operacyjnego dla ruterów i przełączników firmy Extreme Networks",
        "ans":"ExtremeWare OS"
    },
    {
        "id":417,
        "que":"Liczba warstw w modelu warstowym sieci SAN (Storage Area Network)",
        "ans":"3 \/ raczej 5"
    },
    {
        "id":418,
        "que":"Interfejs telefonii analogowej, do którego podłączamy intefejs FXO",
        "ans":"FXS"
    },
    {
        "id":419,
        "que":"Nazwa atrybutu BGP informującego o pochodzeniu informacji o prefiksie z iBGP, eBGP lub redystrybucji",
        "ans":"ORIGIN"
    },
    {
        "id":420,
        "que":"Atrybut ścieżki BGP definiowany dla konkretnego rutera i posiadający najwyższy priorytet",
        "ans":"WEIGHT"
    },
    {
        "id":421,
        "que":"Długość nagłówka celki ATM",
        "ans":"5 bajtów"
    },
    {
        "id":422,
        "que":"Nazwa (określenie) centralnego modułu zarządzającego pracą przełączników Cisco z serii 4000, 5000, 6000 (segmentu CORE)",
        "ans":"Supervisor"
    },
    {
        "id":423,
        "que":"Atrybut ścieżki BGP zawierający listę AS, przez które ścieżka przechodzi",
        "ans":"AS_PATH"
    },
    {
        "id":424,
        "que":"podaj 3 warstwy E-Carrier ",
        "ans":"chyba  E1, E9, T1"
    },
    {
        "id":425,
        "que":"Parametry asocjacji TCP",
        "ans":"Typ protokołu, adres i port węzła lokalnego, adres i port węzła zdalnego"
    },
    {
        "id":426,
        "que":"Identyfikatory w ATM",
        "ans":"VCI, VPI"
    },
    {
        "id":427,
        "que":"Wymień 3 rodzaje kategorii \/ prędkości E-carrier",
        "ans":"E2: multiplexing level 2: 8 Mbit\/s, E3: multiplexing level 3: 34 Mbit\/s,E4: multiplexing level 4: 140 Mbit\/s"
    },
    {
        "id":428,
        "que":"Proces uogólniania adresów sieci IP, do których z r(eguły?) prowadzi ta sama ścieżka, stosowany w rutowaniu (..?)",
        "ans":"Route Summarization"
    },
    {
        "id":429,
        "que":"Komenda Cisco IOS umożliwiająca zdefiniowanie reguł rutowania statycznego",
        "ans":"ip route\\"
    },
    {
        "id":430,
        "que":"Komenda Cisco IOS powodująca aktywację procesu (..) RIP w ruterze Cisco",
        "ans":"router rip nazwa"
    },
    {
        "id":431,
        "que":"Dwie główne techniki poszukiwania tras w stosowanych protokołach rutowania dynamicznego IP",
        "ans":"link-state, distance-vector"
    },
    {
        "id":432,
        "que":"Postać skrócona adresu IPv6 2:2:0:0:0:0:2:2",
        "ans":"2:2::2:2"
    },
    {
        "id":433,
        "que":"Odpowiednik IPv4 adresu ::\/128 IPv6",
        "ans":"0.0.0.0\/32"
    },
    {
        "id":434,
        "que":"Rodzaj adresu, który w NAT służy do określenia hosta w sieci publicznej (sieci outside)",
        "ans":"outside global"
    },
    {
        "id":435,
        "que":"Domyślna wartość metryki Administrative Distance dla protokołu rutowania dynamicznego RIP",
        "ans":"120"
    },
    {
        "id":436,
        "que":"Postać skrócona adresu IPv6: 6A3E:A25E:0:0:0:0:0:0",
        "ans":"6A3E:A25E::"
    },
    {
        "id":437,
        "que":"Wariant protokołu ICMP dostosowanego do obsługi IPv6",
        "ans":"ICMPv6"
    },
    {
        "id":438,
        "que":"Długośc identyfikatora NLA w adresie IPv6 (liczba bitów)",
        "ans":"24"
    },
    {
        "id":439,
        "que":"Komenda Cisco IOS powodująca uruchomienie rutowania IPv6 dla ruchu unicast",
        "ans":"ipv6 unicast-routing"
    },
    {
        "id":440,
        "que":"Wariant protokołu rutowania dynamicznego RIP kompatybilnego w IPv6",
        "ans":"RIPng"
    },
    {
        "id":441,
        "que":"Konstrukcja definiowana w Cisco IOS przypisywana do sąsiada BGP i umożliwiająca manipulowanie atrybutami tras",
        "ans":"route-map"
    },
    {
        "id":442,
        "que":"Co oznacza określenie Gateway of last resort w tablicy rutowania",
        "ans":"Jest to domyślna trasa rutowania. Używana gdy jakiekolwiek inne nie będą pasować"
    },
    {
        "id":443,
        "que":"IPv6 adresu 127:0:0:1 IPv4",
        "ans":"::1\/128"
    },
    {
        "id":444,
        "que":"Adres Ipv6 adresy auto konfiguracji IPv4 (gdy host nie dostał adresu przez DHCP)",
        "ans":"fe80::\/10"
    },
    {
        "id":445,
        "que":"Rodzaje ruterów OSPF wyróżniane w ramach pracy tego protokołu",
        "ans":"ABR, Internal router, Backbone router, ASBR"
    },
    {
        "id":446,
        "que":"Nazwa trzeciej warstwy Internet Protocol Suite (to nie to samo co OSI)",
        "ans":"transportowa"
    },
    {
        "id":447,
        "que":"Nazwa instytucji zajmującej się zarządzaniem Systemami Autonomicznymi i BGP w Europie",
        "ans":"RIPE"
    },
    {
        "id":448,
        "que":"Długość (liczba bitów) identyfikatora Systemu Autonomicznego (AS) rutowania IP",
        "ans":"16"
    },
    {
        "id":449,
        "que":"Adres IPv6 będący odpowiednikiem adresu IPv4: 1.254.0.254 w notacji IPv6-mapped-IPv4",
        "ans":"0:0:0:0:FFFF:1.254.0.254\/96"
    },
    {
        "id":450,
        "que":"Nazwy dwóch klas obszarów definiowanych w protokole routowania dynamicznego IS-IS",
        "ans":"Level 1 intra-area, Level 2 inter-area"
    },
    {
        "id":451,
        "que":"Ogólna nazwa protokołów routowania dynamicznego operujących jednocześnie w wielu Systemach Autonomicznych (AS)",
        "ans":"EGP (Exterior gateway protocol)"
    },
    {
        "id":452,
        "que":"Jak nazywamy sieć IP podłączoną bezpośrednio do routera",
        "ans":"Directly connected network (sieć ościenna)"
    },
    {
        "id":453,
        "que":"Zakres unikatowych lokalnych adresów nie routowalnych IPv6",
        "ans":"fc00::\/7"
    },
    {
        "id":454,
        "que":"Komenda Cisco IOS aktywująca w ruterze rutowanie BGP dla AS o wartości 100",
        "ans":"router bgp 100"
    },
    {
        "id":455,
        "que":"Komenda Cisco IOS uruchamiająca funkcję przełącznika Frame Relay w ruterze Cisco",
        "ans":"frame-relay switching"
    },
    {
        "id":456,
        "que":"Wartość ipv4 i maski (w odpowiedniej notacji) określająca wszystkie hosty w internecie",
        "ans":"0.0.0.0\/0"
    },
    {
        "id":457,
        "que":"Jak nazywamy kodowanie bazujące na przenoszących informację zmianach stanu sygnału ? – np. zmiana stanu z L>H oznacza 1, a z H>L oznacza 0 ?",
        "ans":"Manchester"
    },
    {
        "id":458,
        "que":"Jak dzielimy światłowody w zależności od możliwości przesyłania wielu sygnałów równocześnie lub tylko sygnału pojedynczego?",
        "ans":"jednomodowe i wielomodowe"
    },
    {
        "id":459,
        "que":"Alternatywne nazwy procesu prefic aggregation (supernetting) prowadzonego podczas rutowania IP",
        "ans":"route summarization albo route aggregation"
    },
    {
        "id":460,
        "que":"Parametry tras BGP, które można modyfikować w ramach route maps",
        "ans":"WEIGHT, LOCAL_PREFERENCE i MED"
    },
    {
        "id":461,
        "que":"Komenda Cisco IOS włączająca funkcję mostka Ethernet z jednoczesną możliwością rutowania do niego",
        "ans":"bridge <nr> route ip"
    },
    {
        "id":462,
        "que":"Nazwa rutera iBGP umożliwiającego podzielenie AS na części w celu redukcji ilości jednoczesnych sesji BGP",
        "ans":"Route Reflector"
    },
    {
        "id":463,
        "que":"Dwa warianty protokołu BGP (operujący na zewnątrz i wewnątrz AS)",
        "ans":"eBGP i iBGP"
    },
    {
        "id":464,
        "que":"Określenie dla obowiązkowych atrybutów ścieżki BGP",
        "ans":"Powszechnie Obowiązkowe (Well-known Mandatory)"
    },
    {
        "id":465,
        "que":"Komenda Cisco IOS definiująca sąsiada BGP o adresie 1.1.1.1 w AS 5",
        "ans":"neighbor 1.1.1.1 remote-as 5"
    },
    {
        "id":466,
        "que":"Dwie poznane techniki skalowania iBGP",
        "ans":"AS Confederations, Route Reflector"
    },
    {
        "id":467,
        "que":"Wariant rutowania BGP wyłącznie wewnątrz jednego Systemu Autonomicznego",
        "ans":"iBGP"
    },
    {
        "id":468,
        "que":"Rozwinięcie akronimu MED jako atrybutu ścieżki w BGP",
        "ans":"Multi Exit Discriminator"
    },
    {
        "id":469,
        "que":"Nazwa techniki definiowania kilku tras BGP z danego AS z dopuszczeniem wyboru pomiędzy nimi",
        "ans":"multihoming"
    },
    {
        "id":470,
        "que":"Nazwa atrybutu w komunikacie o trasie eBGP zawierającego listę AS, przez które trasa przechodzi",
        "ans":"AS_PATH"
    },
    {
        "id":471,
        "que":"Nazwa grupy AS w BGP agregowanej w celu określenia tych AS zbiorczo wybranymi atrybutami",
        "ans":"Community"
    },
    {
        "id":472,
        "que":"Nazwa atrybutu trasy BGP przypisanego do całego AS i określająca jakość połączenia z innymi AS",
        "ans":"LOCAL_PREFERENCE"
    },
    {
        "id":473,
        "que":"Atrybut trasy BGP, który określa preferowaną trasę gdy dwa AS mają wiele połączeń i nie wiadomo które z nich wybrać",
        "ans":"MED (Multi Exit Discriminator)"
    },
    {
        "id":474,
        "que":"Przynajmniej dwa rodzaje komunikatów w sesji BGP",
        "ans":"open, update, notification, keepalive"
    },
    {
        "id":475,
        "que":"Jaką ma długość i z jakich części składa się adres typu Media Access Control",
        "ans":"długość: 48 bitów Pierwsze 24 bity oznaczają producenta karty sieciowej, pozostałe 24 bity są unikatowym identyfikatorem danego egzemplarza karty"
    },
    {
        "id":476,
        "que":"Nazwa protokołu kontrolującego ruch multicast w sieciach IPv6",
        "ans":"MLD (Multicast Listener Discovery)"
    },
    {
        "id":477,
        "que":"Maksymalna liczba bajtów danych przekazywana w celce ATM",
        "ans":"48 B (+ 5 nagłowek = 53 B)"
    },
    {
        "id":478,
        "que":"Nazwa składowej adresu AESA NSAP identyfikującej fizyczny interfejs będący wyjsciem z ATM",
        "ans":"ESI"
    },
    {
        "id":479,
        "que":"Pole występujące w nagłówkach celu ATM UNI, lecz nie występujące w nagłówku celki ATM NNI",
        "ans":"GFC"
    },
    {
        "id":480,
        "que":"Europejski odpowiednik standardu T-carrier",
        "ans":"E-Carrier"
    },
    {
        "id":481,
        "que":"Przynajmniej dwa warianty techniki multiplexing",
        "ans":"space-division, frequency-division, time-division (podobnie jak w falach radiowych)"
    },
    {
        "id":482,
        "que":"Długośc identyfikatora DLCI we Frame Relay (bity)",
        "ans":"10"
    },
    {
        "id":483,
        "que":"Wewnątrz jakiej jednostki logicznej agregowane są wirtualne kanały ATM (ATM Virtual Channels)",
        "ans":"VPC"
    },
    {
        "id":484,
        "que":"Długośc adresu AESA NSAP ATM",
        "ans":"20 bajtów"
    },
    {
        "id":485,
        "que":"Nazwa sygnału testującego łącze T-carrier",
        "ans":"BERT (Bit-Error Rate Test)"
    },
    {
        "id":486,
        "que":"Parametr określający przepustowośc gwarantowaną w danej chwili czasowej przez dostawcę w technologii Frame Relay",
        "ans":"CIR"
    },
    {
        "id":487,
        "que":"Nazwa składowej adresu AESA NSAP identyfikującej fizyczny interfejs będący wyjściem z ATM",
        "ans":"ESI"
    },
    {
        "id":488,
        "que":"Nazwa atrybutu BGP informująca o pochodzeniu informacji o prefiksie z iBGP, eBGP lub redystrybucji",
        "ans":"Origin"
    },
    {
        "id":489,
        "que":"Dowolny wybrany tryb adaptacji (Adaptive-shaping) przy informowaniu o przeciążeniach w Frame Relay",
        "ans":"FECN\/BECN"
    },
    {
        "id":490,
        "que":"Wariant adresu AESA NSAP ATM stosowany domyślnie w urządzenia Cisco",
        "ans":"ICD"
    },
    {
        "id":491,
        "que":"Rozwinięcie akronimu PVC jako określenia obwodu sieci ATM",
        "ans":"Permanent virtual circiut"
    },
    {
        "id":492,
        "que":"Nazwa ramki przekazywanej między przełącznikami w technologii Frame Relay",
        "ans":"PDU"
    },
    {
        "id":493,
        "que":"Nazwa intefejsu ATM tworzonego pomiędzy dwoma przełącznikami ATM",
        "ans":"NNI"
    },
    {
        "id":494,
        "que":"Unikatowy identyfikator połączenia w technologii Frame Relay (w warstwie 2 ISO OSI)",
        "ans":"DLCI"
    },
    {
        "id":495,
        "que":"Nazwa interfejsu ATM tworzonego pomiędzy przełącznikem ATM a routerem bramką z sieci ATM",
        "ans":"UNI"
    },
    {
        "id":496,
        "que":"Długość identyfikatora DLCI we Frame Relay(bity)",
        "ans":"10"
    },
    {
        "id":497,
        "que":"Wewnątrz jakiej jednostki logicznej agregowane są wirtualne kanały ATM (ATM Virtual Channel)",
        "ans":"VPC (Virtual Path Connection)"
    },
    {
        "id":498,
        "que":"Długość identyfikatora VCI (Virtual Channel Identifier) w celce ATM",
        "ans":"16 bitów"
    },
    {
        "id":499,
        "que":"Długość nagłówki celki ATM",
        "ans":"5 bajtów"
    },
    {
        "id":500,
        "que":"Przynajmniej dwa rodzaje uwierzytelniania w protokole PPP",
        "ans":"PAP,CHAP"
    },
    {
        "id":501,
        "que":"Nazwa (określenie) centralnego modułu zarządzania pracą przełączników Cisco z serii 4000, 5000, 6000 (segmentu CORE)",
        "ans":"Supervisor"
    },
    {
        "id":502,
        "que":"Nazwa portu przełącznika Fibre Channel używana do podłącznia do niego portów z innych urządzeń (serwerów)",
        "ans":"Port F"
    },
    {
        "id":503,
        "que":"Nazwa portu Fibre Channel przełącznika SAN (FC Fabric) służącego do połączenia z innymi przełącznikami SAN",
        "ans":"Port E"
    },
    {
        "id":504,
        "que":"Określenie karty zawierającej serię interfejsów sieciowych w przełącznikach Segmentu CORE",
        "ans":"line card"
    },
    {
        "id":505,
        "que":"Nazwa modułu sprzętowego w przełącznikach Ethernet Cisco używanego do wykrywania zagrożeń w ruchu sieci",
        "ans":"IDS (Intrusion Detection System)"
    },
    {
        "id":506,
        "que":"Określenie dla techniki agregowania łączy w sieciach SAN (Storage Area Network) w celu zwiększenia przepustowości",
        "ans":"Striping"
    },
    {
        "id":507,
        "que":"Liczba warstw w modelu warstwowym sieci SAN (Storeage Area Network)",
        "ans":"3 \/ a nie 5?"
    },
    {
        "id":508,
        "que":"Opisz wyposażenie kabla typu SFTP (S\/FTP). Podaj także rozszerzenie skrótu.",
        "ans":"S\/FTP (dawniej SFTP) –każda para przewodów otoczona jest osobnym ekranem z folii, cały kabel pokryty jest pancerzykiem..\/Shielded Foiled Twisted Pair"
    },
    {
        "id":509,
        "que":"W której warstwie OSI pracuje repaeater ?",
        "ans":"fizycznej"
    },
    {
        "id":510,
        "que":"Standaryzowana jednostka wysokości urządzenia w RACK:",
        "ans":"Unit. 1U = 1.75cala = 44,45 mm"
    },
    {
        "id":511,
        "que":"Nazwa technologii umożliwiającej przesyłanie danych z użyciem przewodów sieci energetycznej",
        "ans":"PLC - power line communication"
    },
    {
        "id":512,
        "que":"Urzadzenie pasywne montowane w szafie krosowniczej RACK umożliwiające ręczne przełaczanie wtyków RJ45",
        "ans":"Patch panel"
    },
    {
        "id":513,
        "que":"Wariant kabla TP montowanego w miejscach narażonych na zakłócenia elektromagnetyczne",
        "ans":"SFTP"
    },
    {
        "id":514,
        "que":"Wartość MTU dla ramek IEE 802.11 bez uwzględnienia WEP",
        "ans":"2304 bajtów"
    },
    {
        "id":515,
        "que":"Określenie trybu komunikowania w parach (czyli punkt punkt bez użycia Access Point ) stosowanego w IEEE 802.11",
        "ans":"Ad hoc - IBSS (Independent Basic Service Set)"
    },
    {
        "id":516,
        "que":"Co oznacza akronim SSID ww technologii IEEE 802.11",
        "ans":"service set identifier"
    },
    {
        "id":517,
        "que":"Odpowiednik funkcjonalności CSMA\/CD stosowany w standardzie IEEE 802.11",
        "ans":"CSMA\/CA (Carrier Sense Multiple Access \/ with Collision Avoidance)"
    },
    {
        "id":518,
        "que":"Zakres prędości transmisji (Mbps) dla standardu IEEE 802.11a",
        "ans":"6-54Mb\/s"
    },
    {
        "id":519,
        "que":"Rozwinięcie akronimu TKIP w standardzie IEEE 802.11",
        "ans":"Temporal Key Integrity Protocol"
    },
    {
        "id":520,
        "que":"Na czym polega pasywne skanowanie kanałów w IEEE 802.11",
        "ans":"nasłuchiwanie ruchu ramek beacon kierowanych do stacji z przełączeniem skanowania na kolejne kanały"
    },
    {
        "id":521,
        "que":"Moce urządzeń nadawczych kolejno w klasach 1,2,3 definiowanych w IEE 802.15 (Bluetooth)",
        "ans":"100 mW, 2,5 mW, 1 mW"
    },
    {
        "id":522,
        "que":"Podaj wzór określający EIRP",
        "ans":"EIRP = P - Tk + Gi\ngdzie EIRP i P (moc nadajnika) podane są w dBm, Tk (tłumienie kabla) w dB a Gi (zysk anteny w stosunku do anteny izotropowej) w dB"
    },
    {
        "id":523,
        "que":"Nazwa technologii definiowanej standardem IEEE 802.16",
        "ans":"WiMAX (Worldwide Interoperability for Microwave Access)"
    },
    {
        "id":524,
        "que":"Rozmiar pola \"numer sekwencji\" w nagłówku TCP",
        "ans":"32 bity"
    },
    {
        "id":525,
        "que":"Rodzaje urządzeń ZigBee",
        "ans":"ZigBee Coordinator, ZigBee Router, ZigBee End Device"
    },
    {
        "id":526,
        "que":"Nazwa trybu IP PIM push mode rutowania dynamicznego IP Multicast",
        "ans":"PIM dense mode"
    },
    {
        "id":527,
        "que":"Jaką informację zawiera pojedynczy wpis w tablicy rutowania IPv4 Multicast?",
        "ans":"???? Jak ktoś wie, niech odpowie w komentarzu"
    },
    {
        "id":528,
        "que":"Nazwa rutera IGMP czynnie kontrolującego obecność zarejestrowanych wcześniej odbiorców ruchu IP multicast",
        "ans":"Querier"
    },
    {
        "id":529,
        "que":"Nazwa rutera centralnego (zarządzającego procesem rutowania w ramach protokołu ODR (On Demant Ruting)",
        "ans":"ODR-HUB\n"
    },
    {
        "id":530,
        "que":"Przeznaczenie pola tzw. rozmiaru okna (Window size) w datagramie TCP",
        "ans":"16-bitowe pole używane przez komputer docelowy w celu poinformowania komputera źródłowego o tym, ile danych jest gotów przyjąć w jednym segmencie TCP."
    },
    {
        "id":531,
        "que":"i",
        "ans":"PIM push-mode"
    },
    {
        "id":532,
        "que":"Pełna nazwa pola w datagramie IP umożliwiającego przenoszenie informacji na temat QoS",
        "ans":"DSCP\/ECN"
    },
    {
        "id":533,
        "que":"Przynajmniej 4 rodzaje obszarów (area) definiowanych wewnątrz domeny OSFP i w ramach tego protokołu",
        "ans":"backbone area, standard area, stub area, totally stubby area, area 0"
    },
    {
        "id":534,
        "que":"Przeznaczenie technologii IP SLA (Sevice Level Agreement) użytkowanej w systemach operacyjnych dla ruterów IP",
        "ans":"monitorowanie infrastruktury wykorzystywanej w procesach rutowania IP oraz podejmowanie zaprogramowanych akcji po wykryciu określonego jej stanu"
    },
    {
        "id":535,
        "que":"Rozwinicie akronimów IRB oraz CRB jako technologii mostkowania ruchu sieciowego w ruterach Cisco",
        "ans":"Integrated Routing and Bridging, Concurrent Routing and Bridging"
    },
    {
        "id":536,
        "que":"Nazwa wyróżnionego rutera IP multicast przechowującego informacj o grupach multicast w IP PIM sparse mode",
        "ans":"Rendezvous Point"
    },
    {
        "id":537,
        "que":"Nazwa iterfejsu ATM tworzonego pomidzy dwoma przełącznikami ATM (w przeciwiestwie do interfejsu pomidzy przełącznikiem ATM i ruterem IP)",
        "ans":"NNI - Network-Network Interface"
    },
    {
        "id":538,
        "que":"Liczba bitów w adresie IPv4 klasy B, przyznaczonych do określenia adresu hosta w sieci IP",
        "ans":16
    },
    {
        "id":539,
        "que":"Nazwa techniki (w Cisco IOS) umożliwiającej wykorzystywanie list kontrolnych (ACL) do kontroli procesu rutowania dynamicznego",
        "ans":"route-map"
    },
    {
        "id":540,
        "que":"Co oznacza akronim SSID ww technologii IEEE 802.11 (wystarczyło rozwinąć skrót)",
        "ans":"service set identifier"
    },
    {
        "id":541,
        "que":"Grupa datagramów wysyłanych i rozpatrywanych jednocześnie przez MPLS",
        "ans":" "
    },
    {
        "id":542,
        "que":"Akronim dla synchronicznych sieci optycznych",
        "ans":"SONET"
    },
    {
        "id":543,
        "que":"siec do nadania adresacji IPV6",
        "ans":"NDP????"
    },
    {
        "id":544,
        "que":"zakres adresow ipv4 dla multicast",
        "ans":"224.0.0.0 - 239.255.255.255 (klasa D)"
    },
    {
        "id":545,
        "que":"którą klasę CoS (IEEE 802.1p) do telefonu IP w zarządzaniu jakosci usług",
        "ans":5
    },
    {
        "id":546,
        "que":"nazwac stan pewnej liczby ruterów, które mają spójne info o topo",
        "ans":"adjacentne"
    },
    {
        "id":547,
        "que":"IRB i CRB - rozwinąć akronimy",
        "ans":"Integrated routing and bridging, Concurent routing and bridging"
    },
    {
        "id":548,
        "que":"przeliczyc CoS na DSCP w polach IP (coś takiego)",
        "ans":"przemnożyć przez 8"
    },
    {
        "id":549,
        "que":"jaki tryb VTP tworzenie nowych vlanow jest niemozliwe przez admina",
        "ans":"Client"
    },
    {
        "id":550,
        "que":"tryb pracy portu private vlan, tak aby połączone ze sobą porty mogły się komunikowac",
        "ans":"community(grupa izolowana)"
    },
    {
        "id":551,
        "que":"wartosć napięcia zasilonia PoE IEEE 802.3af",
        "ans":"15.4W \/\/ napięcie w watach? \/\/nie zdałem fizyki xd"
    },
    {
        "id":552,
        "que":"w jakiej sytuacji sytuacji istotne jest ustawienie bramki domyslnej komendą ´ ip default-gateway",
        "ans":"https:\/\/arstechnica.com\/civis\/viewtopic.php?t=149362"
    },
    {
        "id":553,
        "que":"nazwa rutera IGMP czynnie (reszta pytania nieznana)->mamy querier(odpytuje hosty) i non-querier, ktore odpowiadają, czyli pewnie o querier",
        "ans":"querier"
    },
    {
        "id":554,
        "que":"pasywne skanowanie kanałów ieee 802.11",
        "ans":"??? jest pasywne i aktywne \/ no w pasywnym wysyła te beacony co jakiś czas"
    },
    {
        "id":555,
        "que":"tryb pracy sieci san .... - petla z arbitrazem",
        "ans":"simplex(TR-RX), maximum 127 urządzeń"
    },
    {
        "id":556,
        "que":"co najmniej 4 obszary ospf(  <3 \"conajmniej 4\", kiedy jest w ogóle ich 5)",
        "ans":"backbone, stub, notSoStubby, Totally Stub, Standard"
    },
    {
        "id":557,
        "que":"okreslenie używane wobec rutera MPLS będącego odbiorcą datagramu MPLS",
        "ans":"downstream router"
    },
    {
        "id":558,
        "que":"reprezentacja maski ipv4 kiedy 1.1.1.1\/18",
        "ans":"11111111.11111111.11000000.00000000 - 255.255.192.0"
    },
    {
        "id":559,
        "que":"nazwa standardu portu STP do którego przechodzi ten port po podł ˛aczeniu kabla",
        "ans":"listening - a nie blocking?"
    },
    {
        "id":560,
        "que":"Jakie napięcie (lub zakres napięc) jest wykorzystywane w technologii Power over Ethernet ?",
        "ans":"25-60V"
    },
    {
        "id":561,
        "que":"Jakie nadałbys Class of Service dla Telefonii IP",
        "ans":5
    },
    {
        "id":562,
        "que":"Jak przeliczyc ToS na DSCP ?note: tos(ipv4) w 1988 został zastąpiony przez dscp+ecn, gdzie 6bitów idzie na QoS a 2 bity na przeciążenia",
        "ans":"?czyli że po prostu bierzesz pierwsze 6 bitów z ToS i chyba gotowe?"
    },
    {
        "id":563,
        "que":"Kiedy nalezy zdefiniować w ruterze Default Gateway ?",
        "ans":"?kiedy nie chcesz żeby sieć była odizolowana?"
    },
    {
        "id":564,
        "que":"W jakim trybie przełącznika w Virtual Trunking Protocol funkcja tworzenia przez administratora VLAN-ów jest zablokowana ?",
        "ans":"client"
    },
    {
        "id":565,
        "que":"Okreslenie oznaczaj ˛ace stan zgodności (zbieżności) tablic rutowania w dwóch ruterach (podac nazwę polską i angielską).",
        "ans":"zbieżność, convengence"
    },
    {
        "id":566,
        "que":"datagram ToS ale co z nim? podam eee \"ciekawostkę\"",
        "ans":"np ma 8 bitów"
    },
    {
        "id":567,
        "que":"usługa (?) przekazukąca wiedzę o trasach",
        "ans":"LSA (?) \/\/raczej tak lsa to komunikat upakowany w LSU, który tez jest komunikatem, nie wiem czy o to chodzi"
    },
    {
        "id":568,
        "que":"plik konfiguracyjny VLAN",
        "ans":"vlan.dat"
    },
    {
        "id":569,
        "que":"jaka technologia daje nam VRF bez MPLS",
        "ans":"VRF Lite"
    },
    {
        "id":570,
        "que":"nazwa ramki sprawdzaj ˛aca obecnos´c poł ˛aczenia klientów w 801.11 (a nie 802.11 ?)",
        "ans":"beacon"
    },
    {
        "id":571,
        "que":"A na drugiej stronie połączenie telefonii VOIP, stworzyc ją i podać za pomocą jakich połączen łączymy poszczególne urzadzenia (telefony VOIP, centralkę jeszcze jakies telefony i switch (?) Ethernet).",
        "ans":"chyba to 5 slajd tu http:\/\/sieci.kis.agh.edu.pl\/przedmioty\/wykladWAN.pdf \/\/ a wie ktoś, jakie są te połączenia? (w sensie jakimi kablami)"
    },
    {
        "id":572,
        "que":"technologia swiatłowodowa, która umożliwia przesyłanie o wielu częstotliwosciach",
        "ans":"FDM - Frequency Division Multiplexing"
    },
    {
        "id":573,
        "que":"Technologia umozliwiająca przesyłanie kilku sygnałach o kilku częstotliwościach w jednym łaczu swiatłowodowym",
        "ans":"to co wyżej"
    },
    {
        "id":574,
        "que":"Nazwa pliku konfiguracyjnego w przeł ˛aczniku Ethernet, w którym zapisane s ˛a przypisania portów do poszczególnych VLAN-ów",
        "ans":"?czyżby też vlan.dat?"
    },
    {
        "id":575,
        "que":"W jaki sposób przeliczyc ToS(Type of Service) na Precedence",
        "ans":"pierwsze 3 bity w ToS oznaczają precedence"
    },
    {
        "id":576,
        "que":"Nazwa routera\/urządzenia(juz nie pamiętam dokładnie), do którego jest podpięte wiele łącz point-to-point i posredniczy w wymianie informacji pomiędzy nimi",
        "ans":"hub-and-spoke(w point-to-multipoint)"
    },
    {
        "id":577,
        "que":"nazwa ramek, za pomocą których stacja AP(chyba Access Point) sprawdza, jakie stacje obecnie są do niej podłączone",
        "ans":"Beacon"
    },
    {
        "id":578,
        "que":"Zakres adresów IPv4 w klasie C",
        "ans":"192.0.0.0-223.255.255.255"
    },
    {
        "id":579,
        "que":"Wysokość przełącznika Core to 60 cm (1 cal = 2,54 cm). Ile takich przełączników pomieści się w szafie krosowniczej typu full-size (wysokiej)",
        "ans":"Full size ma ponad 1,8m, czyli zmieszczą się 3."
    },
    {
        "id":580,
        "que":"Co z otrzymanym datagramem IP adresowanym do hosta 2.2.1.2 zrobi nie-klasowy ruter IP posiadający w tablicy rutowania IP reguły 2.2.2.2\/24 via 1.1.1.1 i 0.0.0.0\/0 via 1.1.1.2",
        "ans":"Będzie sprawdzać dalej zasady a jak nie znajdzie to zastosuje domyślną."
    },
    {
        "id":581,
        "que":"Technologia pozwalająca na użytkowanie wielu forwarding table w jednym fizycznym ruterze IP jednocześnie",
        "ans":"VRF- virtual routing and forwarding table"
    },
    {
        "id":582,
        "que":"Nazwy symboliczne przynajmniej dwóch standardów transmisji Ethernet w oparciu o gigabitowe łącza światłowodowe",
        "ans":"100BASE-FX 100BASE-LX"
    },
    {
        "id":583,
        "que":"Co jest celem procesu router solitication stosowanej w IPv6 i współpracującym z nim protokole NDP",
        "ans":"Znalezienie routerów podpiętych na danym łączu w neighbour discovery protocol"
    },
    {
        "id":584,
        "que":"Nazwy parametrów protokołu STP (Spanning Tree Protocol)  w przełącznikach Ethernet, wpływających KOLEJNO na wybór aktywnej ścieżki do Root-bridge",
        "ans":"cost, priority, port number"
    },
    {
        "id":585,
        "que":"Nazwa (angielska) technologii umożliwiającej przesyłanie danych z użyciem przewodów sieci energetycznej",
        "ans":"PLC (power line communication)"
    },
    {
        "id":586,
        "que":"Adresy IPv4 wszystkich hostów, znajdujących się w sieci: 200.200.200.0\/30",
        "ans":"200.200.200.1, 200.200.200.2"
    },
    {
        "id":587,
        "que":"Nazwa portu Private Vlan umożliwiającego komunikowanie wyłącznie z portem Promiscuous",
        "ans":"Isolated"
    },
    {
        "id":588,
        "que":"Jak przeliczyć DSCP na ToS w protokole IP?",
        "ans":"Mnoży się razy 4."
    },
    {
        "id":589,
        "que":"Podaj znaczenie pola ,,identyfikator'' w nagłówku datagramu IP, skoro i tak istnieje w nim pole ,,przesunięcie fragmentacji''",
        "ans":"Identyfikator to wartość przypisana przed fragmentacją a przesunięcie wskazuje do którego miejsca pakietu należy ten fragment."
    },
    {
        "id":590,
        "que":"Parametry asocjacji TCP (określające jednoznacznie strumień TCP)",
        "ans":"Typ protokołu, adres węzła lokalnego i zdalnego i port lokalnego, zdalnego"
    },
    {
        "id":591,
        "que":"Czym różni się OSPF Stub area od OSPF Totally stubby area",
        "ans":"Totally Stub akceptuje pakiety Lsa 1,2, a Stub Lsa 1,2,3"
    },
    {
        "id":592,
        "que":"Wymień rodzaje anten stosowanych w transmisji danych",
        "ans":"dookólne, kierunkowe, szczelinowe, paraboliczne"
    },
    {
        "id":593,
        "que":"Kiedy ze stacji roboczej pracującej z interfejsem Ethernet wysyłany jest datagram Gratitous ARP",
        "ans":"interfejs był wyłączony a zostanie włączony lub gdy ustawimy IP na pracującym interfejsie"
    },
    {
        "id":594,
        "que":"Czym różni się limitowanie przepustowości w technice Leaky bucket od zwykłego ograniczenia przepustowości (zadanego np. w bps)",
        "ans":"leacky bucket jak w \"wiadrze\" skąd wysyłane, w bps po prostu ograniczamy prędkość \/\/leaky bucket jest jak zbiornik z odpływem, a ograniczenie jest jak zwykła rura o zadanej przepustowości"
    },
    {
        "id":595,
        "que":"Dlaczego stosuje się tzw. strategie TCP przy nadawaniu strumienia danych w tym protokole",
        "ans":"Zapobieganie przeciążeniu"
    },
    {
        "id":596,
        "que":"Co to jest server blade",
        "ans":"wielomodułowy, wiele serverów w jednej obudowie, oszczędność mocy"
    },
    {
        "id":597,
        "que":"Dlaczego w technice Assured forwarding QoS Ip stosuje się akurat cztery kody typu Class Selector (CS1-CS4)",
        "ans":"Możliwe wtedy cztery kolejki po trzy klasy"
    },
    {
        "id":598,
        "que":"Co z otrzymanym datagramem IP adresowanym do hosta 2.2.1.2 zrobi klasowy ruter IP posiadający w tablicy rutowania IP reguły 2.2.2.2\/24 via 1.1.1.1 i 0.0.0.0\/0 via 1.1.1.2",
        "ans":"zgeneralizuje do sieci 2 \/\/ (?)"
    },
    {
        "id":599,
        "que":"Co określamy mianem ,,cichy router'' w protokole rutowania dynamicznego RIPv2",
        "ans":"Router bez RIPv2, który podaje dalej informacje dla router'ów RIP"
    },
    {
        "id":600,
        "que":"Angielska nazwa reguły postulującej wybór z IP forwarding table najbardziej precyzyjnej reguły rutowania IP",
        "ans":"longest prefix match"
    },
    {
        "id":601,
        "que":"Podaj przykład protokołu, wobec którego stosowana jest technika RED (Random Early Detection) load shedding",
        "ans":"TCP"
    },
    {
        "id":602,
        "que":"Teoretyczna liczba hostów możliwych do podłączenia w sieci IPv4: 10.10.10.0\/17",
        "ans":"2^15-2"
    },
    {
        "id":603,
        "que":"Jak nazywamy chwilowy duży przepływ danych w sieci komputerowej",
        "ans":"burst"
    },
    {
        "id":604,
        "que":"Liczba grup IPv4 multicast możliwa do rozróżnienia w przełączniku Ethernet po przemapowaniu do adresacji Ethernet MAC",
        "ans":"2^23"
    },
    {
        "id":605,
        "que":"Jaką topologię fizyczną sieci komputerowej wytworzy układ połączeń urządzeń aktywnych określany mianem ,,daisy-chain''",
        "ans":"pierścień lub liniowa"
    },
    {
        "id":606,
        "que":"Klasa adresu IPv4: 225.225.225.225",
        "ans":"D"
    },
    {
        "id":607,
        "que":"Na jakie składowe podzielone jest pasmo częstotliwości w technologii Cable Modem",
        "ans":"HFC, RFoG"
    },
    {
        "id":608,
        "que":"Na podstawie jakich konfigurowalnych parametrów obliczana jest długość chwili czasowej TC dla Token Bucket w technologii Traffic Shaping",
        "ans":"CIR i BC"
    },
    {
        "id":609,
        "que":"popularne techniki multipleksowania sygnału w medium transmisyjnym",
        "ans":"TDM, FDM, WDM, CDM (napięciowo, częstotliwościowo, fazowo i ...)"
    },
    {
        "id":610,
        "que":"Do czego służą tzw. tokeny w tablicach rutowania stosowanych w ruterach MPLS",
        "ans":"dokąd przełączyć datagram, jakie operacje na stosie MPLS datagramu wykonać"
    },
    {
        "id":611,
        "que":"Podaj wartość IP precenence dla datagramu IP, gdy wartość klasa QoS datagramu wynikająca z wartości jego pola DSCP wynosi af12 (Assured Forwarding 12)",
        "ans":1
    },
    {
        "id":612,
        "que":"Po czym zorientujesz się, że na hoście docelowym nie ma aplikacji, która mogłaby odebrać datagramu UDP, który wysłałeś? (Nie masz dostępu do hosta zdalnego)",
        "ans":"Port Unreacheable"
    },
    {
        "id":613,
        "que":"Co mówią Ci słowa: Tahoe, Slow Start, Reno w kontekście sieci komputerowych",
        "ans":"Strategie TCP"
    },
    {
        "id":614,
        "que":"W jaki sposób w datagramie IPv6 można zawrzeć informację o fragmentacji, skoro w jego nagłówku nie ma pola identyfikującego przesunięcie lub numer fragmentu",
        "ans":"w extension headers (opcja fragmentation)"
    },
    {
        "id":615,
        "que":"Przynajmniej pięć typów wtyków światłowodowych",
        "ans":"ST FC SC LC MT-RJ"
    },
    {
        "id":616,
        "que":"Jak sprawdzisz (bez urządzeń), czy istniejący światłowód o znanej Ci długości będzie się nadawał do przejścia z obecnie stosowanej technologii 1000Base-SX do 10GBase-SR",
        "ans":"Oba wykorzystuja kable wielomodowe o tej samej dlugosci fali, wiec chyba nie trzeba sprawdzac powinno dzialac(ale pewnosci nie mam)"
    },
    {
        "id":617,
        "que":"Podaj możliwy wymiary szerokości szyn RACK szaf krosowniczych dostępnych na rynku",
        "ans":"10, 19, 24 cale"
    },
    {
        "id":618,
        "que":"Dlaczego przygotowując szyfrowany przekaz przez sieć trzeba przestrzegać zasady redundancji? (należy przedstawić tylko technikę ataku, gdy zasady nie przestrzegano)",
        "ans":"Atak: Ktoś wysyła jakiś losowy komunikat bez redundancji i np. rolety w banku się opuszczają, bo akurat trafił"
    },
    {
        "id":619,
        "que":"Podaj przykładowy adres IPv6 6to4 będący odpowiednikiem adresu IPv4 1.1.1.1",
        "ans":"::FFFF:1.1.1.1\/96  (a nie: 2002:101:101::\/16 ??? format jest taki: 2002:xxxx:xxxx::\/16) --> 0:0:0:0:0:FFFF:x.x.x.x\/96\/ \n"
    },
    {
        "id":620,
        "que":"Co określamy mianem message digest",
        "ans":"algorytm szyfrowania md5"
    },
    {
        "id":621,
        "que":"Podaj przykładowy URL dla protokołu HTTP wykorzystujący adres IPv6 1::1 i port 443",
        "ans":"https:\/\/[1::1]:443\/"
    },
    {
        "id":622,
        "que":"Definiowanie statycznych reguł rutowania IPv6 (zdefiniować reguły rutowania ipv6)",
        "ans":"ipv6 route 1::0\/64 2::2"
    },
    {
        "id":623,
        "que":"Szafa 27U",
        "ans":"1U = 1,75\", (2,54 * 1,75cm = 4,445cm)"
    },
    {
        "id":624,
        "que":"OpenSSL",
        "ans":"SSL - Secure Socket Layers, TLS - Transport Layer Security"
    },
    {
        "id":625,
        "que":"Co z otrzymanym datagramem IP adresowanym do hosta 3.3.3.3 zrobi nie-klasowy  ruter IP posiadający w tablicy rutowania IP reguły 4.4.0.0\/16 via 1.1.1.1 i 0.0.0.0\/0 via 3.3.3.5?",
        "ans":"Dopasuje go do reguły 0.0.0.0\/0 via 3.3.3.5"
    },
    {
        "id":626,
        "que":"Na ile datagramów podzielony zostanie pakiet IPv4 o długości 5000 bajtów gdy konieczne jest przesłanie go przez standardowe łącze Ethernet?",
        "ans":"4"
    },
    {
        "id":627,
        "que":"Dlaczego po zmianie adresu IPv4 w stacji roboczej na kolidujący z adresem innej stacji ta inna stacja natychmiast o tym wie? Jaki protokół wspomaga takie informowanie?",
        "ans":"Ponieważ po zmianie adresu IP wysyłana jest ramka Gratuitous ARP. T akie informowanie wspomaga protokół; ARP."
    },
    {
        "id":628,
        "que":"Dlaczego na jednym komputerze fizycznym posiadającym tylko jeden adres IP możliwe jest serwowanie wielu hostów wirtualnych z własną domeną w ramach protokołu HT TP?",
        "ans":"W ramach protokołu HT TP przesyłana jest informacja o domenie. Serwer, na podstawie domeny, serwuje; stronę korzystając virtualhostów."
    },
    {
        "id":629,
        "que":"Co stanowi zagrożenie dla serwerowni gdy temperatura w pomieszczeniu serwerowni jest za niska?",
        "ans":"Skraplanie się pary wodnej, zjawisko podobne do pojawiania się rosy."
    },
    {
        "id":630,
        "que":"Podaj adres sieci IPv4, w której znajduje się host: 131.3.3.3\/2",
        "ans":"128.0.0.0\/2"
    },
    {
        "id":631,
        "que":"Wymień klasy jakościowe wielomodowych włókien światłowodowych. W jakim celu są definiowane?",
        "ans":"OM1; OM2; OM3; OM4; Są one definiowane w celu określenia ich wydajności transmisyjnej."
    },
    {
        "id":632,
        "que":"Ile jednostek U można zmieścić w szafie krosowniczej typu full-size?",
        "ans":"42U"
    },
    {
        "id":633,
        "que":"Podaj adresy IPv4 wszystkich hostów znajdujących się w sieci: 100.100.100.0\/30",
        "ans":"1. 100.100.100.1\/30; 2. 100.100.100.2\/30"
    },
    {
        "id":634,
        "que":"Podaj przykładowy adres IPv6 6to4 będący odpowiednikiem adresu IPv4: 4.4.4.4",
        "ans":"2002:0404:0404::"
    },
    {
        "id":635,
        "que":"Gdy jednocześnie w ruterze IP użyjesz protokołów OSPF, EIGRP i RIP produkujących sprzeczne informacje o trasach - które z nich trafią do tablicy rutowania IP i dlaczego?",
        "ans":"Do tablicy rutowania IP trafią informacje z EIGRP, ponieważ ma on najniższą wartość administr ative dist ance"
    },
    {
        "id":636,
        "que":"Dlaczego lokalny prces RIPv1 błędnie wygenerował informację o faktycznej zdalnej sieci 11.11.11.0\/24 jako informację o sieci 11.0.0.0\/8 powodując błędy jej w tablicy rutowania IP?",
        "ans":"Ponieważ RIPv1 korzysta z adresacji klasowej. Adres 11.11.11.0 należy do klasy A, o masce 255.0.0.0 (\/8),; natomiast faktyczna sieć korzysta z adresacji bezklasowej."
    },
    {
        "id":637,
        "que":"Podaj przykłady standardów transmisji danych w sieciach komputerowych stosujących time-division multiplexing.",
        "ans":"Internet over Cable; E-carrier \/ T-carrier"
    },
    {
        "id":638,
        "que":"Jaki komunikat ICMP otrzymasz po nieudanej próbie połączenia T CP z hostem zdalnym jeśli okazało się, że serwer (usługa) na tym hoście nie istnieje (nie jest uruchomiona).",
        "ans":"Port unreachable"
    },
    {
        "id":639,
        "que":"Test PING (ICMP) komunikacji do stacji podłączonej bezpośrednio kablem Ethernet nie działa. Co kolejno sprawdzisz?",
        "ans":"1. Działanie kabla Ethernet; 2. Działanie kart sieciowych w hostach; 3. Adresację IP w hostach"
    },
    {
        "id":640,
        "que":"Jaką topologię fizyczną sieci komputerowej wytworzy układ połączeń urządzeń aktywnych określany mianem \"daisy-chain\"?",
        "ans":"liniowa; pierścienia"
    },
    {
        "id":641,
        "que":"Wszystkim interfejsom urządzeń, także stacjom PC, na rysunku nadaj adresację IP wersja 4 w klasie B  zgodnie z ogólnie znanymi regułami. Dodaj do konfiguracji adresy domyślnych bramek w stacjach PC, aby wymusić domyślnie komunikację poprzez bezpośrednio podłączone rutery.",
        "ans":""
    },
    {
        "id":642,
        "que":"Zakładając adresację IP i topologię sieci z poprzedniego zadania podaj reguły rutowania statycznego dla ruterów R1 i R2 - takie, aby umożliwić komunikację pomiędzy dwoma stacjami PC.",
        "ans":"R1: ip route 130.5.0.0 255.255.0.0 130.3.0.2; R2: ip route 130.1.0.0 255.255.0.0 130.3.0.1"
    },
    {
        "id":643,
        "que":"Na poniższym rysunku zdefiniuj adresy IP oraz adresy domyślnej bramki dla dwóch widocznych stacji PC - tak, aby możliwa była komunikacja do Internetu. Zakładamy, iż stacje PC nie posiadają żadnej dodatkowej konfiguracji rutowania IP, a wiedza o rutowaniu IP w ruterach jest prawidłowa. Przełączniki L2 posiadają tylko jeden VL AN, a wszystkie porty są do niego przypisane. Adresy zaznaczone na czerwono",
        "ans":""
    },
    {
        "id":644,
        "que":"Za pomocą odpowiedniego rysunku i jego opisu zawierającego dane adresacyjne przedstaw zasadę działania rutowania pomiędzy sieciami VL AN w Ethernet, implementowanego z wykorzystaniem przełącznika Ethernet warstwy 2 (Layer 2 switch) oraz niezależnego rutera IP. Łączymy przełącznik i ruter trunkiem, interfejsy VL AN adresujemy, by były w różnych podsieciach. T e same sieci wykorzystujemy do zaadresowania podinterfejsów utworzonych w interfejsie rutera. Dodatkowo ustawiamy w interfejsach VL AN adres bramy domyślnej, czyli adres IP odpowiadającego im podinterfejsu w ruterze.",
        "ans":""
    },
    {
        "id":645,
        "que":"Dlaczego w instalacjach lokalnych sieci bezprzewodowych opartych o Wireless L AN Controller wykorzystuje się przełączniki Ethernet z rozszerzeniem P oE (IEEE 802.3af lub IEEE 802.3at)?",
        "ans":"By nie prowadzić równolegle przewodu zasilającego (może to generować zakłócenia)"
    },
    {
        "id":646,
        "que":"Podaj przykłady standardów transmisji danych w sieciach komputerowych stosujących frequency-division multiplexing.",
        "ans":"IEEE 802.11; IEEE 802.15"
    },
    {
        "id":647,
        "que":"Podaj wszystkie adresy IPv6 hostów należących do sieci 1::8\/126",
        "ans":"1::9\/126; 1::10\/126"
    },
    {
        "id":648,
        "que":"Jakim określeniem nazywamy fragmentację datagramów w sieci komputerowej, po której defragmentacja występuje u odbiorcy końcowego, a nie po drodze do niego.",
        "ans":"non-transparent"
    },
    {
        "id":649,
        "que":"Podaj nazwę trybu pracy sieci SAN (w technologii Fibre Channel) opartego o fizyczną topologię pierścienia.",
        "ans":"pętla z arbitrażem"
    },
    {
        "id":650,
        "que":"Podaj główną zaletę stosowania protokołu Multiple Spanning T ree Protocol w Ethernet (IEEE 802.1s).",
        "ans":"Agregowanie VL AN w grupy"
    },
    {
        "id":651,
        "que":"Z jakich komunikatów sieciowych ARP składa się procedura ustalania adresu MA C zdalnego hosta, gdy adres ten jest potrzebny?",
        "ans":"ARP R equest (broadcast); ARP R esponse (unicast)"
    },
    {
        "id":652,
        "que":"Z jakich komunikatów sieciowych T CP składa się procedura ustanawiania połączenia T CP (asocjacji serwera i klienta)?",
        "ans":"SYN-RECEIVE; SYN-EST ABLISH; OPENING; OPEN"
    },
    {
        "id":653,
        "que":"Wymień pola występujące w nagłówku UDP - User Datagram Protocol (są cztery).",
        "ans":"1. Numer portu źródłowego; 2. Numer portu docelowego; 3. Długość; 4. Suma kontrolna"
    },
    {
        "id":654,
        "que":"Z jakiego powodu identyfikator BID (Bridge ID) każdego urządzenia pracującego w ramach protokołu PVSTP musi w sobie zawierać VL AN ID?",
        "ans":"Ponieważ PVSTP działa osobno na każdym VL ANie"
    },
    {
        "id":655,
        "que":"Jak prowadzona jest fragmentacja pakietu IPv6 skoro (w przeciwieństwie do IPv4) w nagłówku IPv6 nie ma już pola przesunięcia fragmentacji?",
        "ans":"Fragmentacja znajduje się w extension headers w IPv6"
    },
    {
        "id":656,
        "que":"Podaj przykładowy URL dla protokołu HT TP wykorzystujący adres IPv6 3:3::3:3 i port T CP 444.",
        "ans":"http:\/\/[3:3::3:3]:444"
    },
    {
        "id":657,
        "que":"Jakiej technologii użyjesz, aby zabezpieczyć urządzenie przed niekontrolowanym odbiorem strumienia multimedialnego danej grupy IP multicast z niewłaściwego hosta IP?",
        "ans":"IGMP"
    },
    {
        "id":658,
        "que":"W jaki sposób w każdej ramce Ethernet przekazać przez łącze Ethernet prowadzące z przełącznika Ethernet do rutera IP informację o CoS?",
        "ans":"Wykorzystując VL AN T AG"
    },
    {
        "id":659,
        "que":"Wartość (liczbowo) maski IP wersja 4 gdy adres sieci w notacji CIDR wynosi 1.1.1.1\/9",
        "ans":"255.128.0.0"
    },
    {
        "id":660,
        "que":"Wymień typy funkcjonalności warstwy drugiej ISO OSI sieci, wykorzystywane w protokole OSPF (np. NBMA).",
        "ans":"point-to-point; point-to-multipoint"
    },
    {
        "id":661,
        "que":"Wszystkim interfejsom IP urządzeń na rysunku nadaj adresację IP wersja 4 w klasie A  zgodnie z ogólnie znanymi",
        "ans":"regułami (określając także domyślne bramki dla stacji PC, gdy potrzebne)."
    },
    {
        "id":662,
        "que":"Za pomocą odpowiedniego rysunku i jego opisu przedstaw problem powstawania pętli rutingu dynamicznego",
        "ans":"występującego w czasie użytkowania tuneli GRE (General R outing Encapsulation)."
    },
    {
        "id":663,
        "que":"W przełączniku rutującym Cisco utworzono dwie sieci VL AN o numerach 2 i 4 oraz podłączoneo do tych sieci po jednej stacji PC. P onadto stworzono w przełączniku interfejs VL AN2 o adresie IP 5.5.5.5\/24 oraz VL AN4 o adresie IP 9.9.9.9\/24. Zapisz adresy IP interfejsów oraz domyślnych bramek w stacjach PC, aby komunikacja pomiędzy nimi poprzez ruter w przełączniku Ethernet była możliwa.",
        "ans":""
    },
    {
        "id":664,
        "que":"Na poniższym rysunku połącz odpowiednie urządzenia i podpisz połączenia oraz użyte porty urządzeń (skrętka zwykła, skrętka z przeplotem, FXS, FX O) - tak, aby powstała jedna spójna sieć telefonii PO TS i VoIP. Uwaga: PBX posiada tylko jedno gniazdo Ethernet. ",
        "ans":""
    },
    {
        "id":665,
        "que":"Podaj rodzaj multipleksowania stosowany w łączu typu E-carrier",
        "ans":"[gpt?] TDM (Time Division Multiplexing)"
    },
    {
        "id":666,
        "que":"Przedstaw przeznaczenie pola tzw. rozmiaru okna (Window size) w datagramie TCP",
        "ans":"[gpt?] Kontrola przepływu danych między nadawcą a odbiorcą"
    },
    {
        "id":667,
        "que":"Podaj formułę pozwalającą obliczyć wyrażoną w dBm moc wypromieniowaną EIRP (Effective Isotropic Radiated Power) na podstawie mocy nadawczej wyznaczonej w mW",
        "ans":"[gpt?] EIRP[dBm] = P[nadawcza dBm] + GT[dBi] - CL[dB]"
    },
    {
        "id":668,
        "que":"Podaj klasę adresu IP: 191:191:191:191",
        "ans":"[gpt?] Klasa B"
    },
    {
        "id":669,
        "que":"W jaki sposób w każdym datagramie przekazać przez łącze Ethernet prowadzące z przełącznika Ethernet do rutera IP informację o CoS?",
        "ans":"[gpt?] Poprzez pole nagłówka VLAN (Virtual LAN) lub pole nagłówka Differentiated Services Code Point (DSCP)"
    },
    {
        "id":670,
        "que":"Dlaczego w technice Assured forwarding QoS stosuje się akurat cztery kody typu Class Selector (CS1-CS4)?",
        "ans":"[gpt?] Aby zapewnić priorytetową obsługę i kontrolę przepływu dla różnych klas ruchu"
    },
    {
        "id":671,
        "que":"Co jest celem procesu router solitication stosowanego w IPv6 i współpracującym z nim protokole NDP?",
        "ans":"[gpt?] Zbieranie informacji na temat dostępnych routerów w sieci i konfiguracja adresacji IPv6"
    },
    {
        "id":672,
        "que":"Podaj zasadę działania ramkowania CRC w warstwie 2 modelu ISO OSI",
        "ans":"[gpt?] Dodawanie wartości kontrolnej CRC (Cyclic Redundancy Check) do ramki w celu wykrywania błędów transmisji"
    },
    {
        "id":673,
        "que":"Które datagramy zostaną w pierwszej kolejności usuwane przy stosowaniu polityki milk w load shedding?",
        "ans":"[gpt?] Datagramy o niskim priorytecie lub najmniejszej ważności"
    },
    {
        "id":674,
        "que":"Podaj i uzasadnij skutki nieprawidłowego skonfigurowania wartości MSS (Maximum Segment Size) użytkowanej w protokole TCP",
        "ans":"[gpt?] Może prowadzić do fragmentacji pakietów TCP, wydłużenia czasu transmisji i spadku wydajności sieciowej"
    },
    {
        "id":675,
        "que":"Jak nazywamy chwilowy duży przepływ danych w sieci komputerowej?",
        "ans":"[gpt?] Burst"
    },
    {
        "id":676,
        "que":"Czym różni się limitowanie przepustowości w technice leaky bucket od zwykłego ograniczenia przepustowości (zadanego np. w bps)?",
        "ans":"[gpt?] Leaky bucket pozwala na krótkotrwałe przekroczenie przepustowości w określonych granicach czasowych"
    },
    {
        "id":677,
        "que":"Podaj przynajmniej trzy nazwy szyfrów symetrycznych (tj. używających klucza symetrycznego) stosowanych w technologiach sieciowych",
        "ans":"[gpt?] nan"
    },
    {
        "id":678,
        "que":"DES (Data Encryption Standard), AES (Advanced Encryption Standard), 3DES (Triple Data Encryption Standard)",
        "ans":"[gpt?] nan"
    },
    {
        "id":679,
        "que":"Jak nazywamy urządzenie u dostawcy internetu do którego biegną kable DSL od ruterów DSL poszczególnych abonentów (w nim następuje konwersja łącza do innego medium)",
        "ans":"[gpt?]  DSLAM (Digital Subscriber Line Access Multiplexer)"
    },
    {
        "id":680,
        "que":"Nazwa techniki cyklicznego pobierania\/przesyłania pakietów z kilku rywalizujących ze sobą kolejek w urządzeniu sieciowym mająca na celu sterowanie jakością usług",
        "ans":"[gpt?]  WRR (Weighted Round Robin)"
    },
    {
        "id":681,
        "que":"Wartość standardowej metryki OSPF dla łącza 20 Mbps",
        "ans":"[gpt?]  1"
    },
    {
        "id":682,
        "que":"Odpowiednik IPv6 adresu 127.0.0.1 IPv4 (localhost)",
        "ans":"[gpt?]  ::1"
    },
    {
        "id":683,
        "que":"Nazwa technologii umożliwiającej przesyłanie danych z użyciem przewodów sieci elektroenergetycznej",
        "ans":"[gpt?]  PLC (Power Line Communication)"
    },
    {
        "id":684,
        "que":"Rozwinięcie akronimów IRB i CRB jako technologii mostkowania ruchu sieciowego w ruterach Cisco",
        "ans":"[gpt?]  IRB (Integrated Routing and Bridging), CRB (Circuit Routing and Bridging)"
    },
    {
        "id":685,
        "que":"Wartość napięcia zasilania (lub zakres napięć) stosowanych w technologii PoE (Power over Ethernet) - IEEE 802.3af",
        "ans":"[gpt?]  44-57 V DC"
    },
    {
        "id":686,
        "que":"Kolejne nazwy technologii definiowanych standardem IEEE 802.11 IEEE 802.15 IEEE 802.16",
        "ans":"[gpt?]  IEEE 802.11 - Wi-Fi, IEEE 802.15 - Bluetooth, IEEE 802.16 - WiMAX"
    },
    {
        "id":687,
        "que":"Co to jest server blade?",
        "ans":"[gpt?]  Server blade to cienki, modułowy serwer obliczeniowy, który jest częścią większego systemu blade, w którym wiele serwerów jest umieszczonych w jednym szafie."
    },
    {
        "id":688,
        "que":"Adres sieci IPv4, w której znajduje się host: 10.10.10.10\/16",
        "ans":"[gpt?]  Adres sieci: 10.10.0.0"
    },
    {
        "id":689,
        "que":"Powiedz, co z otrzymanym datagramem IP adresowanym do hosta 2.2.1.2 zrobi klasowy router IP posiadający w tablicy rutowania IP reguły 2.2.2.0\/24 via 1.1.1.1 i 0.0.0.0\/0 via 1.1.1.2",
        "ans":"[gpt?]  Router przekaże datagram do sieci o adresie 2.2.2.0\/24 poprzez interfejs z adresem 1.1.1.1."
    },
    {
        "id":690,
        "que":"Szafa krosownicza RACK może pomieścić 42U. Przełącznik mawysokość 22 cale.",
        "ans":"1 unit 1.75cala wiec 56cali - 2 przelaczniki"
    },
    {
        "id":691,
        "que":"Ile przełączników można pomieścić w szafie?",
        "ans":"[gpt?]  Szafa krosownicza RACK o wysokości 42U może pomieścić (42 * 1.75) 73.5 cali. Przełącznik o wysokości 22 cali zajmuje mniej miejsca, dlatego w szafie można pomieścić (73.5 \/ 22) około 3 przełączniki."
    },
    {
        "id":692,
        "que":"Alternatywa dla protokołu PPP, choć nie dostarczająca autentyfikacji węzłów sieci",
        "ans":"HDLC"
    },
    {
        "id":693,
        "que":"Angielskie określenie czasu przejścia danego datagramu w sieci komputerowej do celu i z powrotem",
        "ans":"Round-Trip-Time"
    },
    {
        "id":694,
        "que":"Angielskie określenie techniki rutowania dynamicznego \"od celu do źródła\" stosowanej w przypadku IP multicast",
        "ans":"Reverse Path Forwarding"
    },
    {
        "id":695,
        "que":"Atrybut BGP umożliwiający ocenę w danym AS drogi z innego sąsiedniego AS",
        "ans":"LOCAL_PREFERENCE"
    },
    {
        "id":696,
        "que":"Atrybut trasy , który określa preferowaną trasę, gdy dwa AS mają wiele połączeń i nie wiadomo które z nich wybrać",
        "ans":"MED (Multi Exit Discriminator)"
    },
    {
        "id":697,
        "que":"Co wyraża wartość pola Time To Live w nagłówku datagramu IP",
        "ans":"liczba przeskoków, no TTL"
    },
    {
        "id":698,
        "que":"Dwa podstawowe rodzaje sieci VLAN",
        "ans":"tagged, port-based"
    },
    {
        "id":699,
        "que":"Dwa typy celek ATM w zależności od typu interfejsu ATM",
        "ans":"UNI, NNI"
    },
    {
        "id":700,
        "que":"Dwa warianty protokołu  (operujący na zewnątrz i wewnątrz AS)",
        "ans":"External Internal"
    },
    {
        "id":701,
        "que":"Długość (liczba bitów) identyfikatora SLA w IPv6",
        "ans":"16 bitów"
    },
    {
        "id":702,
        "que":"Długość adresu MAC dla Ethernet (w bajtach)",
        "ans":6
    },
    {
        "id":703,
        "que":"Długość adresu interfejsu fizycznego w ramkach FC-2 (Fibre Channel)",
        "ans":"24 bity"
    },
    {
        "id":704,
        "que":"Długość celki ATM (bajty)",
        "ans":53
    },
    {
        "id":705,
        "que":"Komenda Cisco IOS definiująca\/aktywująca do edycji dowolnie wybrany pod-interfejs w ruterze Cisco",
        "ans":"int fa0\/0.1"
    },
    {
        "id":706,
        "que":"Komenda Cisco IOS umożliwiająca zdefiniowanie reguły rutowania statycznego",
        "ans":"ip route [sieć docelowa] [maska] [gdzie wysłać]"
    },
    {
        "id":707,
        "que":"Komenda Cisco umożliwiająca przejście do trybu konfigurowania interfejsu FastEthernet nr 0 bezpośrednio w chassis rutera",
        "ans":"int fa 0\/0"
    },
    {
        "id":708,
        "que":"Liczba możliwych klas CoS (IEEE 802.1p) w VLAN",
        "ans":"8"
    },
    {
        "id":709,
        "que":"Liczba typów komunikatów LSA w protokole rutowania dynamicznego IP OSPF",
        "ans":"6 głównych\/11 w sumie"
    },
    {
        "id":710,
        "que":"Limit długości kabla Twisted Pair Cat5e w sieci Ethernet",
        "ans":"100 m"
    },
    {
        "id":711,
        "que":"MTU dla danych ramki Ethernet",
        "ans":"1500 bajtów"
    },
    {
        "id":712,
        "que":"Maksymalna długość drogi dla datagramów przetwarzanej przez protokół rutowania dynamicznego IP RIP",
        "ans":"15"
    },
    {
        "id":713,
        "que":"Maksymalna długość pakietu IP",
        "ans":"64 kB"
    },
    {
        "id":714,
        "que":"Maksymalna wartość identyfikatora Systemu Autonomicznego w BGP",
        "ans":65535
    },
    {
        "id":715,
        "que":"Maksymalna wartość pola TTL w nagłówku datagramu IP",
        "ans":"255"
    },
    {
        "id":716,
        "que":"Max wartość VLAN ID",
        "ans":"raczej 4095"
    },
    {
        "id":717,
        "que":"Minimalna długość ramki Ethernet IEEE 802.3 (w bajtach)",
        "ans":"64 bajty + 8 preambuły i SFD"
    },
    {
        "id":718,
        "que":"Moce urządzeń nadawczych kolejno w klasach 1,2,3 definiowanych w IEEE 802.15 (Bluetooth)",
        "ans":"1 - 100mW, 2 - 2,5mW, 3 - 1mW"
    },
    {
        "id":719,
        "que":"Nazwa (akronim) unikatowego identyfikatora urządzenia w sieciach Fibre Channel",
        "ans":"WWNN, lub WWPN jeśli urządzenie ma parę portów FC"
    },
    {
        "id":720,
        "que":"Nazwa atrybutu trasy  przypisanego do całego AS i określającego jakość połączenia z innym AS",
        "ans":"LOCAL_PREFERENCE"
    },
    {
        "id":721,
        "que":"Nazwa dowolnego komunikatu PDU w protokole SNMP",
        "ans":"GetRequest, GetNextRequest, ִSetRequest, GetResponse, Trap"
    },
    {
        "id":722,
        "que":"Nazwa drugiej warstwy ISO OSI",
        "ans":"Łącza danych"
    },
    {
        "id":723,
        "que":"Nazwa drugiej warstwy Internet Protocol Suite",
        "ans":"internetowa"
    },
    {
        "id":724,
        "que":"Nazwa grupy AS zagregowanej w celu określenia tych AS zbiorczo wybranymi atrybutami",
        "ans":"community"
    },
    {
        "id":725,
        "que":"Nazwa obszaru (area) wyizolowanego w rutowaniu dynamicznym OSPF",
        "ans":"Stub area"
    },
    {
        "id":726,
        "que":"Nazwa pola\/liczby identyfikującej format danych przenoszonych w ramce Ethernet II",
        "ans":"Ethertype"
    },
    {
        "id":727,
        "que":"Nazwa pola\/liczby identyfikującej format danych przenoszonych w ramce Ethernet II",
        "ans":"Ethertype\/długość"
    },
    {
        "id":728,
        "que":"Nazwa portu Ethernet wybranego przez STP jako aktywny, gdy inne porty też są podłączone do tego samego segmentu sieci",
        "ans":"designated port"
    },
    {
        "id":729,
        "que":"Nazwa portu wyłączonego z powodu wykrycia pętli fizycznej przez proces STP w instalacji Ethernet opartej o przełączniki",
        "ans":"blocking port"
    },
    {
        "id":730,
        "que":"Nazwa protokołu umożliwiającego nadbudowanie nad Bluetooth (IEEE 802.15) fragmentacji ramek i QoS",
        "ans":"L2CAP (Logical Link and Class Adaptation Protocol)"
    },
    {
        "id":731,
        "que":"Nazwa rutera OSPF przekazującego informacje o trasach pomiędzy obszarami (area) OSPF",
        "ans":"ABR - Area Border Router"
    },
    {
        "id":732,
        "que":"Nazwa rutera OSPF łączącego dwa różne obszary (area) w domenie OSPF",
        "ans":"ABR - area border router"
    },
    {
        "id":733,
        "que":"Nazwa techniki (w Cisco IOS) umożliwiającej wykorzystanie list kontrolnych ACL do kontroli procesu rutowania dynamicznego",
        "ans":"ROUTE-MAP"
    },
    {
        "id":734,
        "que":"Nazwa trzeciej warstwy modelu ISO\/OSI",
        "ans":"sieciowa"
    },
    {
        "id":735,
        "que":"Określenie techniki segmentacji sieci Fibre Channel przy pomocy przełączników SAN Fabric",
        "ans":"Zoning"
    },
    {
        "id":736,
        "que":"Podaj zaletę stosowania kodowania dwuróżnicowego AMI (Alternate Mark Inversion) sygnałów w sieciach komputerowych",
        "ans":"synchronizacja nadawcy\/odbiorcy, wykrywanie błędów"
    },
    {
        "id":737,
        "que":"Podział protokołów rutowania dynamicznego pod kątem technik wyznaczania tras i składowania informacji o nich",
        "ans":"link state i distance vector (hybrydy: path-vector)"
    },
    {
        "id":738,
        "que":"Podział technik rutowania IP pod kątem interpretowania (bądź nie) klas adresów IP",
        "ans":"classfull\/classless"
    },
    {
        "id":739,
        "que":"Przykład systemu kodowania serii bitów zapewniającego samo-synchronizację transmisji",
        "ans":"Kodowanie Manchester, kodowanie Manchester-różnicowy"
    },
    {
        "id":740,
        "que":"Przynajmniej 3 rodzaje topologii sieci komputerowej",
        "ans":"liniowa, gwiazdy, magistrali"
    },
    {
        "id":741,
        "que":"Przynajmniej 3 rodzaje topologii sieci komputerowej",
        "ans":"gwiazdy, drzewa, pierścienia"
    },
    {
        "id":742,
        "que":"Rodzaje uwierzytelniania w protokole PPP",
        "ans":"PAP, CHAP"
    },
    {
        "id":743,
        "que":"Rozwinięcie akronimu AAL dla ATM",
        "ans":"ATM Adaptation layer"
    },
    {
        "id":744,
        "que":"Rozwinięcie akronimu ARP jako protokołu sieciowego",
        "ans":"Address Resolution Protocol"
    },
    {
        "id":745,
        "que":"Rozwinięcie akronimu CPE jako określenia strony komunikacji w asymetrycznym lub symetrycznym DSL",
        "ans":"Customer-premises equipment"
    },
    {
        "id":746,
        "que":"Rozwinięcie akronimu SVC jako opisu połączenia logicznego w technologii ATM",
        "ans":"Switched Virtual Circuit"
    },
    {
        "id":747,
        "que":"Standard IEEE określający tagowanie VLAN",
        "ans":"IEEE 802.1q"
    },
    {
        "id":748,
        "que":"Technika skalowania iBGP zakładająca tworzenie fikcyjnych AS wewnątrz rzeczywistego AS w celu redukcji ilości sesji BGP",
        "ans":"AS Confederations"
    },
    {
        "id":749,
        "que":"Tryb transmisji umożliwiający ruch tylko w jednym kierunku",
        "ans":"Simplex"
    },
    {
        "id":750,
        "que":"Typ rutowania IP, w którym nastąpi rozgłoszenie datagramu IP do ściśle określonej puli zarejestrowanych odbiorców",
        "ans":"Multicast"
    },
    {
        "id":751,
        "que":"W których wartwach modelu ISO OSI operuje przełącznik rutujący Ethernet",
        "ans":"1 - 3 "
    },
    {
        "id":752,
        "que":"W których wartwach modelu ISO OSI operuje przełącznik rutujący Ethernet",
        "ans":"1 - 3"
    },
    {
        "id":753,
        "que":"Wartość (liczbowo) maski IPv4 1.1.1.1\/26",
        "ans":"255.255.255.192 (ostatni bajt: 128+64)"
    },
    {
        "id":754,
        "que":"Zakres adresów grup IPv4 multicast",
        "ans":"224.0.0.0 - 239.255.255.255"
    }
]